{
  "backend/main.mo": "Motoko actor implementing access-controlled user profiles, push subscriptions, radio stream checks, and request storage using maps and HTTP outcalls.",
  "feature_evidence.json": "JSON report listing feature evidence, affected frontend files, related components, and test IDs.",
  "frontend-file-summaries.txt": "Collection of short summaries describing the purpose and behavior of various frontend source files.",
  "frontend/DEPLOYMENT_DEBUG.md": "Notes documenting rollback to version 99 and listing reverted features for verification.",
  "frontend/index.html": "HTML entry point with PWA metadata, icons, Google Cast SDK, and root mounting element.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, icons, theme colors, and shortcuts.",
  "frontend/public/service-worker.js": "Service worker implementing static asset caching, cache cleanup, and network-first navigation handling.",
  "frontend/README-verify.md": "Guide explaining how to run the frontend verification script before deployment.",
  "frontend/scripts/verify-frontend.mjs": "Node script that verifies TypeScript config, background asset references, service worker setup, and presence of required assets.",
  "frontend/src/App.tsx": "Main React app managing navigation, audio playback state, stream loading, error handling, and UI components like MiniPlayer and BottomTabNav.",
  "frontend/src/components/CastControl.tsx": "Chromecast control button that starts or stops casting and shows status or errors.",
  "frontend/src/components/InstallPrompt.tsx": "Handles PWA installation prompts and device-specific install guides with dismissal logic.",
  "frontend/src/components/navigation/BottomTabNav.tsx": "Renders a bottom tab navigation bar with Home, Shows, and Settings tabs, highlighting the active tab and handling tab changes.",
  "frontend/src/components/player/MiniPlayer.tsx": "Displays a compact audio player with album art, scrolling title, artist info, and a play/pause button, and opens the full player on click.",
  "frontend/src/components/player/TrackTitleMarquee.tsx": "Provides an animated marquee for long track titles with reduced‑motion handling and pause/resume interactions.",
  "frontend/src/components/player/VolumeSlider.tsx": "Implements a volume slider synced with an audio element, updating both UI state and audio volume.",
  "frontend/src/components/PushNotificationsPanel.tsx": "Panel for enabling and displaying push notification subscription status and errors.",
  "frontend/src/components/RequestForm.tsx": "Dialog form for submitting song or shoutout requests with validation and submission handling.",
  "frontend/src/components/ServiceWorkerRecoveryBanner.tsx": "Banner prompting users to refresh or reset when service worker updates or app load errors occur.",
  "frontend/src/components/ShareButton.tsx": "Share button using Web Share API with a fallback modal for copying the app link.",
  "frontend/src/components/shows/ShowCard.tsx": "Shows a card for a radio show with image, description, genres, and schedule, triggering a callback on click.",
  "frontend/src/components/status/LiveBadge.tsx": "Renders a red animated LIVE badge with a ping effect and radio icon.",
  "frontend/src/components/status/OnAirIndicator.tsx": "Displays a small animated pulsing dot indicating on‑air status.",
  "frontend/src/components/TrackNotification.tsx": "Floating notification showing current track, mix, or live show with styling based on type.",
  "frontend/src/data/mockShows.ts": "Defines the Show interface and provides mock show data including titles, descriptions, schedules, genres, and images.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on user identity, reinitializing and invalidating related queries when identity changes.",
  "frontend/src/hooks/useAlbumArtBackground.ts": "Empty hook file with no implementation.",
  "frontend/src/hooks/useAppLifecyclePlaybackRecovery.ts": "Handles restoring audio playback when the page becomes visible, returns from bfcache, or regains focus, requesting manual resume if needed.",
  "frontend/src/hooks/useBackgroundImageDiagnostics.ts": "Logs diagnostic info about whether the body's background image loaded correctly, warning if missing.",
  "frontend/src/hooks/useChromecast.tsx": "Manages Chromecast API initialization, session handling, and casting state for a stream URL.",
  "frontend/src/hooks/useElementCallbackRef.ts": "Provides a stable callback ref that tracks and returns the current DOM element.",
  "frontend/src/hooks/useFavoriteStation.ts": "Tracks and toggles a favorite station flag using localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context handling initialization, login, logout, and stored identity loading.",
  "frontend/src/hooks/useKeyboardFocusIntent.ts": "Detects recent keyboard navigation to distinguish keyboard-driven focus from pointer interactions.",
  "frontend/src/hooks/useMarqueeMeasurements.ts": "Measures container/text widths to determine overflow and compute marquee animation properties.",
  "frontend/src/hooks/useNotifications.ts": "Manages metadata-based notification triggers, deduplication, and browser permission handling.",
  "frontend/src/hooks/usePushSubscription.ts": "Handles browser push subscription workflow including permission, service worker registration, and backend storage.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching stream URLs with fallback logic, checking stream availability, retrieving now playing data, and submitting requests.",
  "frontend/src/hooks/useServiceWorkerRegistration.ts": "Manages service worker registration, update checks, reset operations, and exposes update control state.",
  "frontend/src/hooks/useSleepTimer.ts": "Implements a countdown sleep timer that pauses an audio element when time expires.",
  "frontend/src/hooks/useWakeLock.ts": "Handles requesting and releasing screen wake locks during active playback with visibility-based re-requesting.",
  "frontend/src/index.css": "Defines Tailwind layers, theme variables, global layout styles, background behavior, safe-area handling, and marquee animations.",
  "frontend/src/main.tsx": "Bootstraps the React app, configuring React Query and Internet Identity providers before rendering App.",
  "frontend/src/screens/BrowseShowsScreen.tsx": "Displays a browsable list of shows with genre and day filters and notifies parent when a show is selected.",
  "frontend/src/screens/HomeLiveScreen.tsx": "Live stream home UI showing station info, playback controls, and error/connection states.",
  "frontend/src/screens/NowPlayingScreen.tsx": "Displays now-playing details with album art, playback controls, volume, and sleep timer support.",
  "frontend/src/screens/SettingsAboutScreen.tsx": "Settings page for notifications and refreshing cached background images with service worker integration.",
  "frontend/src/screens/ShowDetailScreen.tsx": "Show detail view rendering schedule, genres, description, and allowing calendar export.",
  "frontend/src/startup/previewDiagnostics.ts": "Startup diagnostics utility capturing early load errors and optionally showing a recovery overlay.",
  "frontend/src/utils/analytics.ts": "Utility functions for safe Google Analytics event tracking including play, pause, and cast events.",
  "frontend/src/utils/ics.ts": "Generates an ICS calendar file for a show by computing the next occurrence and formatting event metadata before triggering a file download.",
  "frontend/src/utils/normalizeArtworkUrl.ts": "Validates and normalizes artwork URLs, converting relative or protocol-relative paths to absolute HTTPS URLs or returning null if invalid.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and managing hash-based routing parameter cleanup.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, screens, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s state, including features, requests, metadata, and current versioning information."
}