{
  "backend/main.mo": "Motoko canister handling user profiles, access control, radio stream checks, requests, and push subscription storage.",
  "feature_evidence.json": "Empty feature evidence report structure.",
  "frontend-file-summaries.txt": "Text file listing summaries of all frontend source files and their roles.",
  "frontend/DEPLOYMENT_DEBUG.md": "Notes on a failed frontend TypeScript build caused by Node.js-typed errors in App.tsx.",
  "frontend/index.html": "HTML entry point with PWA meta tags, icons, Google Cast SDK, and a fallback recovery UI for slow React mounts.",
  "frontend/public/manifest.json": "PWA manifest defining icons, theme color, metadata, and shortcuts for Mawalking Radio.",
  "frontend/public/service-worker.js": "Service worker implementing caching, cache cleanup, and push notification handling with icon caching.",
  "frontend/README-verify.md": "Guide for running the frontend verification script to catch build issues.",
  "frontend/scripts/verify-frontend.mjs": "Node.js script that checks for browser-incompatible types, runs TypeScript checks, and validates asset paths before deployment.",
  "frontend/src/App.tsx": "Main application component managing global state, navigation, playback, and error boundaries for the app.",
  "frontend/src/components/CastControl.tsx": "Chromecast control button enabling users to start or stop casting and track related analytics.",
  "frontend/src/components/InstallPrompt.tsx": "PWA install prompt and OS/browser-specific installation guides with dismissal logic.",
  "frontend/src/components/navigation/BottomTabNav.tsx": "Renders a fixed bottom tab bar for navigating between home, browse, and settings.",
  "frontend/src/components/player/MiniPlayer.tsx": "Shows a compact audio player with track info, album art, and a play/pause button.",
  "frontend/src/components/player/VolumeSlider.tsx": "Provides a slider to control and sync audio element volume.",
  "frontend/src/components/PushNotificationsPanel.tsx": "Panel for enabling and managing web push notifications with subscription status and error handling.",
  "frontend/src/components/RequestForm.tsx": "Dialog form allowing users to submit song or shout‑out requests with validation and backend submission.",
  "frontend/src/components/ServiceWorkerRecoveryBanner.tsx": "Banner prompting users to refresh or reset when app updates or service worker errors occur.",
  "frontend/src/components/ShareButton.tsx": "Share button using Web Share API with a fallback modal for copying the app link.",
  "frontend/src/components/shows/ShowCard.tsx": "Displays a show preview card with image, details, genres, and schedule.",
  "frontend/src/components/status/LiveBadge.tsx": "Renders a red animated badge indicating a live broadcast.",
  "frontend/src/components/status/OnAirIndicator.tsx": "Shows a pulsing accent-colored on-air indicator dot.",
  "frontend/src/components/TrackNotification.tsx": "Displays a styled notification for track events with icons and optional dismissing.",
  "frontend/src/data/mockShows.ts": "Defines the Show interface and mock show data for display.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to authentication and invalidates dependent queries on change.",
  "frontend/src/hooks/useAlbumArtBackground.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useAppLifecyclePlaybackRecovery.ts": "Handles resuming audio playback when page visibility, focus, or bfcache state changes.",
  "frontend/src/hooks/useChromecast.tsx": "Manages Chromecast availability, initialization, casting state, and session handling.",
  "frontend/src/hooks/useFavoriteStation.ts": "Stores and toggles whether the station is marked as a favorite in localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity login, loading stored identities, and managing authentication state via Dfinity AuthClient.",
  "frontend/src/hooks/useNotifications.ts": "Watches now-playing metadata to detect track, mix, or live changes and triggers browser notifications with deduplication and permission handling.",
  "frontend/src/hooks/usePushSubscription.ts": "Manages push subscription flow including permission requests, service worker integration, backend storage, and unsubscribe handling.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend and external API calls with React Query for stream URL, now-playing data, stream availability checks, and request submission.",
  "frontend/src/hooks/useServiceWorkerRegistration.ts": "Handles service worker registration, update detection, reset logic, and readiness state tracking for the app.",
  "frontend/src/hooks/useSleepTimer.ts": "Implements a sleep timer that counts down and pauses audio when finished, with start and cancel controls.",
  "frontend/src/hooks/useWakeLock.ts": "React hook to request and manage the screen wake lock, handling visibility changes and cleanup.",
  "frontend/src/index.css": "Global Tailwind and custom theme styles defining dark OKLCH colors, overlays, and responsive background behavior.",
  "frontend/src/main.tsx": "App entry point initializing React, React Query, Internet Identity provider, and global styles.",
  "frontend/src/screens/BrowseShowsScreen.tsx": "UI for browsing and filtering mock shows by genre and day, displaying results via ShowCard components.",
  "frontend/src/screens/HomeLiveScreen.tsx": "Live radio home screen with playback controls, station info, and quick actions like favoriting and sharing.",
  "frontend/src/screens/NowPlayingScreen.tsx": "Full-screen now-playing view with album art, track info, playback controls, volume slider, and sleep timer.",
  "frontend/src/screens/SettingsAboutScreen.tsx": "Settings and About page with notification settings, station description, and contact links.",
  "frontend/src/screens/ShowDetailScreen.tsx": "React screen showing detailed show info, with image, metadata, and buttons to download an ICS calendar event or set a reminder.",
  "frontend/src/startup/previewDiagnostics.ts": "Captures early startup errors and displays a recovery overlay if critical issues occur.",
  "frontend/src/utils/analytics.ts": "Utility wrappers for safe Google Analytics event tracking with helpers for audio and cast events.",
  "frontend/src/utils/ics.ts": "Generates and downloads an ICS calendar file for a show by computing next occurrence and formatting event fields.",
  "frontend/src/utils/normalizeArtworkUrl.ts": "Validates and normalizes artwork URLs, ensuring absolute HTTPS paths and handling relative or malformed inputs.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, screens, animations, and theme utilities for the frontend.",
  "project_state.json": "Project state indicating pending requests to add a user-provided background image and restore the Play button."
}