{
  "backend/main.mo": "Actor implementing access-controlled user profiles, radio stream checks, request logging, and push subscription storage using maps and HTTP outcalls.",
  "feature_evidence.json": "Feature evidence report describing changes to marquee scrolling speed and listing affected files and components.",
  "frontend-file-summaries.txt": "Pre-generated summaries of multiple frontend files for build and feature analysis.",
  "frontend/DEPLOYMENT_DEBUG.md": "Notes detailing a TypeScript build failure caused by Node.js typings used in browser code.",
  "frontend/index.html": "Main HTML entry with PWA metadata, Google Cast SDK, and a fallback recovery UI for React mount timeouts.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, icons, theme colors, and shortcuts.",
  "frontend/public/service-worker.js": "Service worker handling caching, activation cleanup, and push notification display with versioned cache names.",
  "frontend/README-verify.md": "Guide for running a frontend verification script to detect build issues before deployment.",
  "frontend/scripts/verify-frontend.mjs": "Node script that validates TypeScript config, checks for NodeJS.Timeout usage, verifies asset references, and inspects service worker configuration.",
  "frontend/src/App.tsx": "Main application component managing navigation, audio playback state, service worker recovery, and global providers like React Query.",
  "frontend/src/components/CastControl.tsx": "Chromecast control button that starts or stops casting the stream and shows casting status.",
  "frontend/src/components/InstallPrompt.tsx": "PWA install prompt handling logic for Android, iOS, and desktop with deferred prompts and platform-specific guides.",
  "frontend/src/components/navigation/BottomTabNav.tsx": "Renders a fixed bottom tab bar with Home, Shows, and Settings tabs and handles tab switching.",
  "frontend/src/components/player/MiniPlayer.tsx": "Shows a compact media player with album art, scrolling title, play/pause control, and tap-to-open behavior.",
  "frontend/src/components/player/TrackTitleMarquee.tsx": "Provides an auto-scrolling marquee for long track titles with reduced‑motion and interaction pause handling.",
  "frontend/src/components/player/VolumeSlider.tsx": "Implements a volume slider synced to an audio element and updates volume on change.",
  "frontend/src/components/PushNotificationsPanel.tsx": "Panel that lets users enable or view subscription status for push notifications with error handling.",
  "frontend/src/components/RequestForm.tsx": "Dialog form for submitting song or shoutout requests with validation and backend submission.",
  "frontend/src/components/ServiceWorkerRecoveryBanner.tsx": "Banner notifying users about service worker errors or updates with actions to refresh or reset the app.",
  "frontend/src/components/ShareButton.tsx": "Share button using the Web Share API with a fallback modal for copying the app link to clipboard.",
  "frontend/src/components/shows/ShowCard.tsx": "Displays show info including image, description, genres, and schedule in a clickable card.",
  "frontend/src/components/status/LiveBadge.tsx": "Shows a red animated LIVE badge with a radio icon.",
  "frontend/src/components/status/OnAirIndicator.tsx": "Renders a small pulsing dot indicating on‑air status.",
  "frontend/src/components/TrackNotification.tsx": "Displays a styled now-playing notification with icons, colors, and optional dismiss support based on notification type.",
  "frontend/src/data/mockShows.ts": "Defines the Show interface and provides a list of mock show objects with metadata.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useAlbumArtBackground.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useAppLifecyclePlaybackRecovery.ts": "Handles playback recovery on visibility changes, page restores, and focus events, attempting to auto‑resume audio or signal manual resume.",
  "frontend/src/hooks/useBackgroundImageDiagnostics.ts": "Checks body background-image after mount and logs a warning if missing or failed to load.",
  "frontend/src/hooks/useChromecast.tsx": "Manages Chromecast API initialization, session handling, device availability, and casting state for a provided stream URL.",
  "frontend/src/hooks/useFavoriteStation.ts": "Tracks and toggles a user's favorite station flag using localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading stored identities, managing login/logout, and exposing login status.",
  "frontend/src/hooks/useMarqueeMeasurements.ts": "Measures text and container widths to decide overflow and compute marquee animation properties with retries and remount keys.",
  "frontend/src/hooks/useNotifications.ts": "Watches now-playing metadata to detect track, mix, or live changes and triggers browser notifications with deduping.",
  "frontend/src/hooks/usePushSubscription.ts": "Handles subscribing and unsubscribing to push notifications using the service worker, VAPID key, and backend storage.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching the stream URL with fallbacks, checking stream availability, fetching now-playing data, and submitting requests.",
  "frontend/src/hooks/useServiceWorkerRegistration.ts": "Implements service worker registration, update handling, reset logic, and state management for registration readiness and errors.",
  "frontend/src/hooks/useSleepTimer.ts": "Provides a countdown sleep timer that pauses an audio element after a set duration with start and cancel controls.",
  "frontend/src/hooks/useWakeLock.ts": "Manages screen wake lock requests and releases based on activity, including visibility-change reactivation and cleanup.",
  "frontend/src/index.css": "Global Tailwind-based styles defining theme variables and responsive background images with image-set fallbacks.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up React Query and Internet Identity providers before rendering the main App component.",
  "frontend/src/screens/BrowseShowsScreen.tsx": "Displays a filterable list of mock shows by genre and day, rendering ShowCards and allowing selection or filter resets.",
  "frontend/src/screens/HomeLiveScreen.tsx": "A live radio home screen showing station info, playback status, and a main play/pause button with error and loading handling.",
  "frontend/src/screens/NowPlayingScreen.tsx": "Displays detailed now-playing info with album art, playback controls, volume, and a sleep timer.",
  "frontend/src/screens/SettingsAboutScreen.tsx": "Settings screen providing notification controls and a background image refresh feature with cache clearing.",
  "frontend/src/screens/ShowDetailScreen.tsx": "Shows detailed info about a selected radio show with image, schedule, genres, and an option to download a calendar event.",
  "frontend/src/startup/previewDiagnostics.ts": "Startup diagnostics module that collects early load errors and shows a recovery overlay if critical issues occur.",
  "frontend/src/utils/analytics.ts": "Utility for safe Google Analytics event tracking, including play, pause, and casting events.",
  "frontend/src/utils/ics.ts": "Generates an ICS calendar file for a show by computing the next occurrence and triggering a download.",
  "frontend/src/utils/normalizeArtworkUrl.ts": "Cleans and validates artwork URLs, converting them to absolute HTTPS paths or returning null if invalid.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL and session-based parameters, including hash routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, screens, and animations for the frontend.",
  "project_state.json": "Describes the project state and feature request to adjust marquee scrolling speed."
}