{
  "backend/main.mo": "Main Motoko actor implementing user profiles, push notifications, song requests, radio stream availability checks, and access control with role-based permissions (user/admin).",
  "feature_evidence.json": "Feature evidence report documenting two completed features: updating the email address and website URL in the Settings/About screen.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend files including App.tsx with routing, hooks for queries/notifications/lifecycle management, components for UI elements, and service worker configuration.",
  "frontend/DEPLOYMENT_DEBUG.md": "Documentation for version 99 rollback that reverted experimental features including background system, marquee animation, and service worker complexity.",
  "frontend/index.html": "HTML entry point with PWA meta tags, manifest links, Apple mobile web app configuration, and Google Cast SDK integration.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, icons, theme colors, display mode, and shortcuts for Mawalking Radio version 99.",
  "frontend/public/service-worker.js": "Service worker v3.1 implementing cache-first strategy for static assets, network-first for navigation, and push notification handling with click-to-focus behavior.",
  "frontend/README-verify.md": "Guide for running the frontend verification script to detect build-breaking issues before deployment.",
  "frontend/scripts/verify-frontend.mjs": "Node.js verification script that checks TypeScript config, validates background asset paths in CSS and service worker, and confirms asset file existence.",
  "frontend/src/App.tsx": "Main React app component managing multi-view routing (home, now-playing, browse, venues, settings), audio playback state, user location, wake lock, and lifecycle recovery hooks.",
  "frontend/src/components/CastControl.tsx": "A Chromecast control button component that allows users to start/stop casting audio streams to Chromecast devices, with loading states and toast notifications.",
  "frontend/src/components/InstallPrompt.tsx": "A PWA install prompt component that detects device/browser type (iOS Safari, Android Chrome, etc.) and shows platform-specific installation guides with dismissal tracking.",
  "frontend/src/components/navigation/BottomTabNav.tsx": "Bottom navigation bar component with three tabs (Home, Shows, Settings) that displays icons and labels, handles tab switching, and includes safe area insets for mobile devices.",
  "frontend/src/components/player/MiniPlayer.tsx": "Compact player UI component that displays current track info with album art, marquee title, artist name, and play/pause button; clicking the container opens the full now-playing view.",
  "frontend/src/components/player/TrackTitleMarquee.tsx": "Animated marquee component for scrolling long track titles with support for reduced motion preferences, keyboard navigation, and pause/resume on user interaction.",
  "frontend/src/components/player/VolumeSlider.tsx": "Volume control slider component that syncs with an HTML audio element reference and updates volume from 0-100.",
  "frontend/src/components/PushNotificationsPanel.tsx": "A settings panel for managing push notification subscriptions with diagnostics display, error handling, and browser support detection.",
  "frontend/src/components/RequestForm.tsx": "A dialog form component for submitting song requests or shout-outs to the DJ, with validation and success/error toast notifications.",
  "frontend/src/components/ServiceWorkerRecoveryBanner.tsx": "An alert banner that prompts users to refresh or reset the app when service worker updates are available or load errors occur.",
  "frontend/src/components/ShareButton.tsx": "A share button component that uses the Web Share API when available, falling back to a modal with clipboard copy functionality.",
  "frontend/src/components/shows/ShowCard.tsx": "Card component displaying radio show information including image, title, description, genres, day, and time with hover effects and click handling.",
  "frontend/src/components/status/LiveBadge.tsx": "Badge component displaying a pulsing \"LIVE\" indicator with radio icon for showing live broadcast status.",
  "frontend/src/components/status/OnAirIndicator.tsx": "Simple pulsing dot indicator component to show on-air status.",
  "frontend/src/components/TrackNotification.tsx": "A toast-style notification component that displays now-playing track information with different visual styles for live shows, mixes, and regular tracks.",
  "frontend/src/components/venues/VenueCard.tsx": "Card component displaying venue details including name, address, distance, description, and action buttons for calling or viewing details.",
  "frontend/src/components/venues/venueLinks.ts": "Utility functions to build phone call links and Google Maps directions URLs from venue data, preferring coordinates over address strings.",
  "frontend/src/data/mockShows.ts": "Mock data defining Show interface and array of seven sample radio shows with Congolese music genres, schedules, and placeholder images.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an authenticated or anonymous backend actor based on Internet Identity, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useAdminRole.ts": "Hook that checks if the current user has admin role by calling the backend actor's isCallerAdmin method with caching and error handling.",
  "frontend/src/hooks/useAlbumArtBackground.ts": "Hook file for album art background functionality (content truncated/empty in provided snippet).",
  "frontend/src/hooks/useAppLifecyclePlaybackRecovery.ts": "React hook that monitors page visibility, focus, and bfcache events to automatically resume audio playback when the app returns to the foreground, respecting user intent and handling OS-level audio interruptions.",
  "frontend/src/hooks/useBackgroundImageDiagnostics.ts": "Diagnostic hook that checks if the body background image loaded correctly after mount and logs warnings with expected asset paths if the image is missing or failed to load.",
  "frontend/src/hooks/useChromecast.tsx": "React hook that initializes and manages Chromecast functionality, providing methods to detect cast availability, connect to devices, and stream audio to Chromecast receivers using the Chrome Cast SDK.",
  "frontend/src/hooks/useElementCallbackRef.ts": "Utility hook that combines a callback ref with state to provide both a stable ref setter and the current element instance, enabling effects to trigger when the DOM node changes.",
  "frontend/src/hooks/useFavoriteStation.ts": "Simple hook that manages a boolean favorite state persisted to localStorage, providing the current favorite status and a toggle function.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication on ICP, managing AuthClient initialization, login flow, identity persistence, and providing authentication state throughout the component tree.",
  "frontend/src/hooks/useKeyboardFocusIntent.ts": "Hook that detects keyboard navigation intent by tracking Tab and arrow key presses, returning true during keyboard activity and false on pointer interactions to distinguish keyboard from programmatic focus.",
  "frontend/src/hooks/useMarqueeMeasurements.ts": "Hook that measures container and text element dimensions to determine if marquee animation is needed, calculating CSS animation properties (duration, distance, gap) for seamless left-to-right scrolling based on overflow and configured speed.",
  "frontend/src/hooks/useNotifications.ts": "Manages in-app and browser notifications for track changes, detecting show types (track/mix/live) and preventing duplicate notifications with debouncing. Requests notification permissions and displays notifications with artwork when tracks change.",
  "frontend/src/hooks/usePushSubscription.ts": "Handles push notification subscription management using service workers and VAPID keys. Checks existing subscriptions, requests permissions, creates new subscriptions, and syncs them with the backend actor.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching stream URLs (with HTTPS fallback), checking stream availability, fetching now-playing data from the radio API, and submitting song requests. Implements retry logic and error handling for all queries.",
  "frontend/src/hooks/useRequestAdminRole.ts": "Provides a mutation hook to request admin role from the backend actor and invalidates the admin status query on success.",
  "frontend/src/hooks/useServiceWorkerRegistration.ts": "Manages service worker registration, updates, and lifecycle including detecting update availability, applying updates, and resetting the service worker. Handles registration errors gracefully and provides diagnostics.",
  "frontend/src/hooks/useSleepTimer.ts": "Implements a countdown sleep timer that automatically pauses audio playback when elapsed. Provides start and cancel functions with second-by-second countdown tracking.",
  "frontend/src/hooks/useStreamInterruptionRecovery.ts": "Handles automatic recovery from stream interruptions using exponential backoff retry logic. Detects stream errors, stalls, and unexpected endings, attempting to reload and resume playback up to a maximum retry limit.",
  "frontend/src/hooks/useUserLocation.ts": "React hook that manages user location detection with GPS and IP-based fallback, including permission states, loading states, and retry functionality with configurable timeouts.",
  "frontend/src/hooks/useVenueQueries.ts": "React Query hooks for fetching nearby venues by location, fetching venue by ID, and submitting new venues with automatic cache invalidation.",
  "frontend/src/hooks/useWakeLock.ts": "React hook that manages Screen Wake Lock API to prevent device screen from sleeping during active playback, with automatic re-acquisition on visibility changes.",
  "frontend/src/index.css": "Global Tailwind CSS configuration with dark theme variables, responsive background image system, marquee animation keyframes, safe area insets for mobile devices, and fixed bottom UI clearance utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient, InternetIdentityProvider, and renders the main App component.",
  "frontend/src/screens/AdminVenuesScreen.tsx": "Admin interface for managing venue submissions with tabs for pending and approved venues, supporting approve, reject, and remove actions with confirmation dialogs.",
  "frontend/src/screens/BrowseShowsScreen.tsx": "Screen component for browsing radio shows with genre and day filters, displaying filtered results in a card list layout.",
  "frontend/src/screens/HomeLiveScreen.tsx": "Main home screen displaying live radio player controls, favorite/share buttons, notification permission prompts, and a list of nearby venues using geolocation. Includes play/pause, error handling, and distance calculation utilities.",
  "frontend/src/screens/NowPlayingScreen.tsx": "Full-screen now playing view with album art, track info marquee, volume controls, and sleep timer functionality. Displays current song metadata and provides playback controls with background blur effects.",
  "frontend/src/screens/SettingsAboutScreen.tsx": "Settings and about page with push notification configuration, admin role management, background cache refresh functionality, and navigation to venue submission and admin panels.",
  "frontend/src/screens/ShowDetailScreen.tsx": "Detail view for radio shows displaying schedule, genres, description, and actions to add to calendar or set reminders. Uses mock show data and generates ICS calendar files.",
  "frontend/src/screens/VenueDetailScreen.tsx": "Venue detail screen showing full information including address, contact details, hours, amenities, and action buttons for calling, getting directions, and visiting website. Fetches venue data by ID.",
  "frontend/src/screens/VenuesListScreen.tsx": "React component that displays a list of nearby rhumba venues based on user location, calculates distances using the Haversine formula, and handles loading/error states with venue selection callbacks.",
  "frontend/src/screens/VenueSubmitScreen.tsx": "Form screen for submitting new venue information including business details, location coordinates, contact info, venue type, amenities, and photo URLs. Includes validation and submission handling.",
  "frontend/src/startup/previewDiagnostics.ts": "Collects and displays startup errors (resource, script, rejection, service worker) before React mounts, showing a recovery overlay only when critical errors exceed a threshold.",
  "frontend/src/utils/analytics.ts": "Google Analytics utility providing safe event tracking functions for audio playback (play/pause) and Chromecast events with typed parameters and silent failure handling.",
  "frontend/src/utils/ics.ts": "Generates and downloads ICS calendar files for radio show schedules, calculating next show dates based on day/time and formatting events in iCalendar format.",
  "frontend/src/utils/normalizeArtworkUrl.ts": "Validates and normalizes artwork URLs from now-playing metadata, handling relative paths, protocol-relative URLs, and enforcing HTTPS-only absolute URLs.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both query strings and hash-based routing, with sessionStorage persistence and cleanup capabilities for sensitive parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, extended screens, animations, and theme tokens for a radio app UI with sidebar and chart components.",
  "project_state.json": "Project metadata tracking two completed features for updating email and website URL in the Settings/About screen for Mawalking Radio application."
}