{
  "backend/main.mo": "Motoko actor implementing access-controlled user profiles, radio stream checks, request storage, and push subscription management using maps and HTTP outcalls.",
  "feature_evidence.json": "Feature evidence report listing affected files, components, and metadata for marquee animation adjustments.",
  "frontend-file-summaries.txt": "Compiled summaries of multiple frontend files describing their roles, behavior, and recent updates.",
  "frontend/DEPLOYMENT_DEBUG.md": "Notes on a failing frontend TypeScript build caused by browser-incompatible Node.js typings in App.tsx.",
  "frontend/index.html": "Main HTML entry point with PWA metadata, icons, Cast SDK, and a recovery UI shown if React fails to mount.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, icons, colors, and shortcuts for Mawalking Radio.",
  "frontend/public/service-worker.js": "Service worker handling asset caching, cache versioning, cleanup, and push notifications.",
  "frontend/README-verify.md": "Guide explaining how to run the frontend verification script to detect build issues.",
  "frontend/scripts/verify-frontend.mjs": "Node-based script that verifies TypeScript config, checks for unsafe typings, validates background assets, and inspects service worker settings.",
  "frontend/src/App.tsx": "Main app component managing navigation, audio playback, data fetching, service worker recovery, and global UI elements.",
  "frontend/src/components/CastControl.tsx": "Chromecast control button that starts or stops casting the audio stream and shows casting status.",
  "frontend/src/components/InstallPrompt.tsx": "PWA install prompt and device-specific install guides with detection logic for iOS, Android, and browser conditions.",
  "frontend/src/components/navigation/BottomTabNav.tsx": "Fixed bottom navigation bar with three tabs and active-state styling.",
  "frontend/src/components/player/MiniPlayer.tsx": "A compact audio player showing track info, album art, and play/pause controls with click-to-open behavior.",
  "frontend/src/components/player/TrackTitleMarquee.tsx": "A marquee component that scrolls long track titles with motion preferences and interaction-based pausing.",
  "frontend/src/components/player/VolumeSlider.tsx": "A slider that controls and reflects the volume of a referenced audio element.",
  "frontend/src/components/PushNotificationsPanel.tsx": "UI panel for enabling and displaying status of push notifications, including subscription workflow and error handling.",
  "frontend/src/components/RequestForm.tsx": "Modal form allowing users to submit song or shoutout requests with validation and backend submission.",
  "frontend/src/components/ServiceWorkerRecoveryBanner.tsx": "Banner notifying users of app update or load errors with options to refresh or reset the app.",
  "frontend/src/components/ShareButton.tsx": "Share button using Web Share API with fallback modal for copying the app link manually.",
  "frontend/src/components/shows/ShowCard.tsx": "Displays show metadata with image, genres, schedule, and click handling using styled card components.",
  "frontend/src/components/status/LiveBadge.tsx": "A red animated badge indicating live status with a pulsing dot and icon.",
  "frontend/src/components/status/OnAirIndicator.tsx": "A simple pulsing dot indicator representing on-air status.",
  "frontend/src/components/TrackNotification.tsx": "A notification component that displays track info with styling based on type and supports dismissing.",
  "frontend/src/data/mockShows.ts": "Provides mock show data and a Show interface describing show structure.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAlbumArtBackground.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useAppLifecyclePlaybackRecovery.ts": "Hook that attempts to resume audio playback after visibility, focus, or page-restore events and notifies on failure.",
  "frontend/src/hooks/useBackgroundImageDiagnostics.ts": "Hooks checks body background-image after mount and logs a warning if missing.",
  "frontend/src/hooks/useChromecast.tsx": "Provides Chromecast availability, connection, session handling, and media casting logic.",
  "frontend/src/hooks/useFavoriteStation.ts": "Stores and toggles a boolean favorite flag in localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context with login, logout, and stored identity restoration.",
  "frontend/src/hooks/useMarqueeMeasurements.ts": "Calculates text overflow, scroll distance, duration, and remount key for marquee animations.",
  "frontend/src/hooks/useNotifications.ts": "Detects track/mix/live changes and manages browser notification permissions and display deduping.",
  "frontend/src/hooks/usePushSubscription.ts": "Handles subscribing/unsubscribing to push notifications and storing subscription via backend actor.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for stream URL retrieval, stream availability checks, now playing data, and submitting song/shoutout requests with fallback handling.",
  "frontend/src/hooks/useServiceWorkerRegistration.ts": "Manages service worker registration, update handling, reset logic, and exposes SW state through a custom hook.",
  "frontend/src/hooks/useSleepTimer.ts": "Implements a countdown sleep timer that pauses audio and allows starting or canceling the timer.",
  "frontend/src/hooks/useWakeLock.ts": "Handles requesting and releasing screen wake locks based on activity state and visibility changes.",
  "frontend/src/index.css": "Defines Tailwind layers, theme variables, and responsive background images for mobile and desktop layouts.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and mounts the root component.",
  "frontend/src/screens/BrowseShowsScreen.tsx": "Displays a filterable list of mock shows with genre and day selectors and triggers selection callbacks.",
  "frontend/src/screens/HomeLiveScreen.tsx": "Main live radio screen showing header, now-playing info, and play/pause controls with loading and error handling states.",
  "frontend/src/screens/NowPlayingScreen.tsx": "Expanded now-playing view with album art, track details, playback controls, volume slider, and sleep timer options.",
  "frontend/src/screens/SettingsAboutScreen.tsx": "Settings page providing notification management and background image cache refresh functionality.",
  "frontend/src/screens/ShowDetailScreen.tsx": "Show detail view displaying show info, schedule, genres, and actions like adding the event to a calendar.",
  "frontend/src/startup/previewDiagnostics.ts": "Startup diagnostics utility that collects early boot errors and displays a recovery overlay if critical issues occur.",
  "frontend/src/utils/analytics.ts": "Google Analytics helper functions for safe gtag event tracking, including play, pause, and cast events.",
  "frontend/src/utils/ics.ts": "Generates an ICS calendar file for a radio show and computes the next show date with proper time formatting. Includes helpers for date conversion to ICS format.",
  "frontend/src/utils/normalizeArtworkUrl.ts": "Normalizes artwork URLs by handling protocol-relative, relative, and absolute paths, enforcing HTTPS and returning null for invalid inputs.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL parameters, storing them in sessionStorage, and retrieving persisted values across navigation. Includes helpers for hash-based routing and safe storage operations.",
  "frontend/tailwind.config.js": "Defines Tailwind CSS configuration with custom colors, themes, breakpoints, animations, and plugin integrations for typography, container queries, and animations.",
  "project_state.json": "Stores project metadata including schema version, features, issues, and a pending request to adjust marquee motion behavior."
}