{
  "backend/main.mo": "Main Motoko actor implementing user profiles, push notifications, radio stream availability checks, song requests, and access control with role-based permissions for users and admins.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features documented.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend components including App.tsx routing, React Query hooks with stream fallback, responsive styling, notification system, PWA features, and lifecycle management hooks.",
  "frontend/DEPLOYMENT_DEBUG.md": "Documentation for version 99 rollback that reverted experimental features including background system, marquee animation, service worker complexity, and diagnostics.",
  "frontend/index.html": "HTML entry point with PWA meta tags, manifest links, Apple touch icons, viewport configuration, and Google Cast SDK integration.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, icons, theme colors, display mode, orientation, and shortcuts for Mawalking Radio.",
  "frontend/public/service-worker.js": "Service worker v3.1 implementing cache-first strategy for static assets, network-first for navigation, push notification handling, and notification click handlers to focus/open app windows.",
  "frontend/README-verify.md": "Guide for running the frontend verification script to detect build-breaking issues before deployment.",
  "frontend/scripts/verify-frontend.mjs": "Node.js verification script that checks TypeScript config, validates background asset paths in CSS and service worker, and confirms required asset files exist before deployment.",
  "frontend/src/App.tsx": "Main React app component managing multi-view routing (home, now-playing, browse, venues, settings, admin), audio playback state, user location, lifecycle recovery, wake lock, and bottom navigation with mini player.",
  "frontend/src/components/CastControl.tsx": "Chromecast control button component that toggles casting to devices, displays connection status, tracks analytics events, and shows toast notifications for cast state changes.",
  "frontend/src/components/InstallPrompt.tsx": "Detects device/browser type and displays appropriate PWA installation prompts for Chrome (beforeinstallprompt), iOS Safari, and Android Chrome with dismissal tracking and standalone mode detection.",
  "frontend/src/components/navigation/BottomTabNav.tsx": "Fixed bottom navigation bar with three tabs (Home, Shows, Settings) that handles safe area insets and active state styling.",
  "frontend/src/components/player/MiniPlayer.tsx": "A fixed-position mini player component that displays current track info with album art, a marquee title, and play/pause controls. Clicking the container opens the full now-playing view.",
  "frontend/src/components/player/TrackTitleMarquee.tsx": "An accessible marquee component that scrolls long track titles horizontally with pause-on-interaction support, respecting reduced motion preferences and keyboard navigation intent.",
  "frontend/src/components/player/VolumeSlider.tsx": "A volume control slider component that syncs with an HTML audio element's volume property, displaying and updating volume from 0-100.",
  "frontend/src/components/PushNotificationsPanel.tsx": "Renders a card UI for managing push notification subscriptions with support detection, subscription status display, diagnostics info, and error handling.",
  "frontend/src/components/RequestForm.tsx": "Modal dialog form for submitting song requests or shout-outs to the DJ with validation, loading states, and toast notifications for success/error feedback.",
  "frontend/src/components/ServiceWorkerRecoveryBanner.tsx": "Fixed-position alert banner that prompts users to refresh or reset the app when updates are available or load errors occur.",
  "frontend/src/components/ShareButton.tsx": "Share button component that uses native Web Share API when available, falling back to a modal with copy-to-clipboard functionality for sharing the app URL.",
  "frontend/src/components/shows/ShowCard.tsx": "A clickable card component displaying radio show details including image, title, description, genres, day, and time with hover effects.",
  "frontend/src/components/status/LiveBadge.tsx": "A red badge component with animated pulsing dot and radio icon to indicate live broadcast status.",
  "frontend/src/components/status/OnAirIndicator.tsx": "A small animated pulsing dot indicator to show on-air status.",
  "frontend/src/components/TrackNotification.tsx": "Toast-style notification component that displays currently playing track info with different visual styles for live shows, mixes, and regular tracks.",
  "frontend/src/components/venues/VenueCard.tsx": "A card component displaying venue information including name, address, distance, description, and action buttons for calling or viewing details.",
  "frontend/src/components/venues/venueLinks.ts": "Utility functions to build phone and Google Maps directions links from venue data, preferring coordinates over address strings.",
  "frontend/src/data/mockShows.ts": "Mock data defining radio show schedule with 7 shows featuring Congolese music genres (Rhumba, Soukous, Ndombolo, Afro Zouk) across different days and times.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an authenticated or anonymous backend actor based on Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminRole.ts": "Hook that checks if the current user has admin privileges by calling the backend actor's isCallerAdmin method.",
  "frontend/src/hooks/useAlbumArtBackground.ts": "Empty file with no content.",
  "frontend/src/hooks/useAppLifecyclePlaybackRecovery.ts": "Hook that automatically resumes audio playback when the app becomes visible or regains focus after being hidden, respecting user intent and handling bfcache restoration.",
  "frontend/src/hooks/useBackgroundImageDiagnostics.ts": "Diagnostic hook that checks if the body background image loaded correctly after mount and logs warnings with expected file paths if it failed.",
  "frontend/src/hooks/useChromecast.tsx": "Manages Chromecast integration including device discovery, session management, and media casting with support for connecting, playing, pausing, and stopping cast sessions.",
  "frontend/src/hooks/useElementCallbackRef.ts": "Provides a stable callback ref and tracks the latest mounted element, enabling effects to trigger when the ref points to a new DOM node.",
  "frontend/src/hooks/useFavoriteStation.ts": "Manages favorite station state persisted in localStorage with toggle functionality.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for ICP integration, managing login state, identity persistence, and AuthClient configuration.",
  "frontend/src/hooks/useKeyboardFocusIntent.ts": "Tracks whether the user is navigating via keyboard (Tab/arrow keys) to distinguish keyboard focus from programmatic or screen-reader focus, resetting on pointer activity.",
  "frontend/src/hooks/useMarqueeMeasurements.ts": "Measures container and text widths to determine overflow and computes CSS properties for seamless left-to-right marquee scrolling with dynamic speed and duration calculations.",
  "frontend/src/hooks/useNotifications.ts": "Manages browser notifications for track changes, detecting show types (track/mix/live) and displaying notifications with deduplication and permission handling.",
  "frontend/src/hooks/usePushSubscription.ts": "Handles push notification subscription management including permission requests, service worker integration, and backend subscription registration via actor.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching radio stream URLs with HTTPS validation and fallback, now-playing data from the API, and submitting song requests (not yet implemented). Includes retry logic and automatic refetching for now-playing data.",
  "frontend/src/hooks/useRequestAdminRole.ts": "Exports a mutation hook that calls the backend actor to request admin role and invalidates the admin status query on success.",
  "frontend/src/hooks/useServiceWorkerRegistration.ts": "Manages service worker registration lifecycle including update detection, cache reset, and automatic reloading. Provides methods to apply updates and reset the service worker with cache clearing.",
  "frontend/src/hooks/useSleepTimer.ts": "Implements a countdown sleep timer that automatically pauses audio playback when elapsed. Provides start and cancel controls with second-by-second countdown.",
  "frontend/src/hooks/useStreamInterruptionRecovery.ts": "Handles automatic recovery from audio stream interruptions with exponential backoff retry logic. Monitors stream stalls, errors, and unexpected endings to restore playback when the user wants to continue listening.",
  "frontend/src/hooks/useUserLocation.ts": "Attempts to determine user location by trying GPS first with a short timeout, then falling back to IP-based geolocation. Tracks permission state and provides retry functionality.",
  "frontend/src/hooks/useVenueQueries.ts": "Provides React Query hooks for fetching nearby venues by location/radius, getting individual venues by ID, and submitting new venue proposals. Includes mutation for venue submission with query invalidation.",
  "frontend/src/hooks/useWakeLock.ts": "React hook that manages the Screen Wake Lock API to prevent device screen from sleeping during active playback, with automatic re-acquisition on visibility/focus changes and cleanup on unmount.",
  "frontend/src/index.css": "Global styles with Tailwind configuration, dark theme CSS variables (OKLCH color space), responsive background image setup, marquee animation keyframes, safe area insets for mobile notches, and fixed bottom UI clearance utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/screens/AdminVenuesScreen.tsx": "Admin interface for managing venue submissions with tabs for pending and approved venues, supporting approve/reject/remove actions with confirmation dialogs and role-based access control.",
  "frontend/src/screens/BrowseShowsScreen.tsx": "Screen displaying filterable list of radio shows with genre and day filters, using mock data and ShowCard components for navigation.",
  "frontend/src/screens/HomeLiveScreen.tsx": "Main live radio screen with play/pause controls, station favoriting, location-based nearby venue discovery (top 3), notification permission handling, and error/loading states.",
  "frontend/src/screens/NowPlayingScreen.tsx": "Full-screen now playing interface with album art, track info marquee, volume controls, sleep timer selection, and share functionality over a blurred background.",
  "frontend/src/screens/SettingsAboutScreen.tsx": "Settings and About screen component that displays app information, admin controls, push notification settings, and venue management options. Includes functionality to refresh background cache and request admin access.",
  "frontend/src/screens/ShowDetailScreen.tsx": "Show detail screen component that displays full information about a specific show including image, schedule, genres, and description. Provides actions to add the show to calendar or set reminders.",
  "frontend/src/screens/VenueDetailScreen.tsx": "Venue detail screen component that fetches and displays comprehensive venue information including address, contact details, hours, amenities, and music genres. Provides actions to call venue or get directions.",
  "frontend/src/screens/VenuesListScreen.tsx": "Venues list screen that displays nearby rhumba venues based on user location, calculates distances, and shows loading/error states. Allows users to select a venue to view details.",
  "frontend/src/screens/VenueSubmitScreen.tsx": "Venue submission form screen that allows users to submit new rhumba venues with details like name, address, contact info, venue type, amenities, and photos. Includes form validation and success/error handling.",
  "frontend/src/startup/previewDiagnostics.ts": "Diagnostic utility that captures and categorizes startup errors (resource, script, rejection, service worker) before React mounts. Shows recovery overlay for critical errors and provides error summaries for debugging.",
  "frontend/src/utils/analytics.ts": "Google Analytics utility providing typed event tracking functions (play, pause, cast) with safe gtag availability checks and silent failure handling.",
  "frontend/src/utils/ics.ts": "Generates and downloads ICS calendar files for radio show schedules, calculating next show date based on day/time and formatting to iCalendar standard.",
  "frontend/src/utils/normalizeArtworkUrl.ts": "Validates and normalizes artwork URLs from API metadata, handling relative paths, protocol-relative URLs, and enforcing HTTPS-only absolute URLs.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from query strings or hash-based routing, with sessionStorage persistence and cleanup capabilities.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH, container settings, extended screens, border radius variables, and custom animations.",
  "project_state.json": "Project state tracking file indicating pending feature requests to add current principal as admin and verify Admin Panel visibility in Settings."
}