{
  "backend/main.mo": "Backend actor providing user profiles, radio stream checks, push subscriptions, and request storage with permission enforcement via AccessControl.",
  "feature_evidence.json": "Feature evidence report listing feature requirements, involved components, and associated files for updates to background images and service worker caching.",
  "frontend-file-summaries.txt": "Mapping of frontend file paths to short descriptions summarizing their functionality and recent updates.",
  "frontend/DEPLOYMENT_DEBUG.md": "Notes on a failed frontend TypeScript build caused by Node.js typings in browser code, including affected lines.",
  "frontend/index.html": "Main HTML entry point defining meta tags, manifest links, Google Cast SDK, and a recovery UI for React mount timeouts.",
  "frontend/public/manifest.json": "PWA manifest defining metadata, icons, theme colors, categories, and shortcuts for the Mawalking Radio app.",
  "frontend/public/service-worker.js": "Service worker implementing cache versioning 4.6, aggressive cache cleanup, background asset caching, and push notification handling.",
  "frontend/README-verify.md": "Guide describing how to run the frontend verification script to catch build issues before deployment.",
  "frontend/scripts/verify-frontend.mjs": "Node script that verifies TypeScript config, checks for NodeJS.Timeout usage, validates background asset paths, and inspects service worker settings.",
  "frontend/src/App.tsx": "Main app component managing navigation, audio playback, state initialization, and global providers.",
  "frontend/src/components/CastControl.tsx": "Chromecast control button that starts or stops casting and shows status feedback.",
  "frontend/src/components/InstallPrompt.tsx": "PWA installation prompt handling platform detection, deferred install events, and install guides.",
  "frontend/src/components/navigation/BottomTabNav.tsx": "Renders a fixed bottom navigation bar with tabs and icons, updating the active tab on selection.",
  "frontend/src/components/player/MiniPlayer.tsx": "Shows a compact audio player with artwork, marquee title, and play/pause control that opens a full player when tapped.",
  "frontend/src/components/player/TrackTitleMarquee.tsx": "Implements a scrolling marquee for track titles with motion preferences, pause interactions, and dynamic measurement logic.",
  "frontend/src/components/player/VolumeSlider.tsx": "Provides a slider UI to control and sync audio element volume.",
  "frontend/src/components/PushNotificationsPanel.tsx": "UI panel for enabling and showing the status of web push notification subscriptions.",
  "frontend/src/components/RequestForm.tsx": "Dialog form allowing users to submit song or shout‑out requests to the backend.",
  "frontend/src/components/ServiceWorkerRecoveryBanner.tsx": "Banner prompting users to refresh or reset when service worker errors or updates occur.",
  "frontend/src/components/ShareButton.tsx": "Share button using Web Share API with a fallback dialog for copying the app link.",
  "frontend/src/components/shows/ShowCard.tsx": "Displays show info with image, description, genres, and schedule in a clickable card.",
  "frontend/src/components/status/LiveBadge.tsx": "Renders a red animated LIVE badge with an icon.",
  "frontend/src/components/status/OnAirIndicator.tsx": "Shows a pulsing dot to indicate on-air status.",
  "frontend/src/components/TrackNotification.tsx": "Displays a styled notification for track events with icons, colors, and optional dismiss handling.",
  "frontend/src/data/mockShows.ts": "Defines the Show interface and provides mock show data for display.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries on identity changes.",
  "frontend/src/hooks/useAlbumArtBackground.ts": "Empty file placeholder for album art background hook.",
  "frontend/src/hooks/useAppLifecyclePlaybackRecovery.ts": "Handles auto-resuming audio playback when the app regains visibility or focus, with fallbacks when manual resume is needed.",
  "frontend/src/hooks/useBackgroundImageDiagnostics.ts": "Checks if the body background image successfully loads and logs a warning or success after a delay.",
  "frontend/src/hooks/useChromecast.tsx": "Manages Chromecast availability, initialization, session handling, casting state, and errors for a given stream URL.",
  "frontend/src/hooks/useFavoriteStation.ts": "Tracks and toggles a favorite station flag in localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context for Internet Identity login, logout, identity persistence, and status tracking using Dfinity AuthClient.",
  "frontend/src/hooks/useMarqueeMeasurements.ts": "Measures container and text widths to determine overflow and compute marquee animation properties with retries and remounting logic.",
  "frontend/src/hooks/useNotifications.ts": "Handles notification permissions, detects track/mix/live changes, deduplicates alerts, and triggers browser notifications.",
  "frontend/src/hooks/usePushSubscription.ts": "Manages push subscription creation, permission requests, backend registration, and unsubscribe flow using a service worker and VAPID keys.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for stream URL retrieval with fallback, stream availability checks, now playing data, and submitting requests.",
  "frontend/src/hooks/useServiceWorkerRegistration.ts": "Manages service worker registration, update handling, reset logic, and exposes state and update actions.",
  "frontend/src/hooks/useSleepTimer.ts": "Implements a sleep timer that pauses audio after a countdown with start and cancel controls.",
  "frontend/src/hooks/useWakeLock.ts": "Handles acquiring and releasing screen wake locks during active playback with visibility-based re-requesting.",
  "frontend/src/index.css": "Defines Tailwind layers, theme variables, and responsive background images with light/dark support.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider, rendering the root component.",
  "frontend/src/screens/BrowseShowsScreen.tsx": "Renders a filterable list of shows using genre and day selectors and navigates on show selection.",
  "frontend/src/screens/HomeLiveScreen.tsx": "Live listening screen showing station header, now-playing info, and a stateful play/pause button with loading and error handling.",
  "frontend/src/screens/NowPlayingScreen.tsx": "Expanded now‑playing view with album art, track metadata, playback controls, volume slider, and optional sleep timer.",
  "frontend/src/screens/SettingsAboutScreen.tsx": "Settings and about page providing notification controls and a tool to refresh cached background images.",
  "frontend/src/screens/ShowDetailScreen.tsx": "Displays detailed info for a show with image, schedule, genres, description, and calendar‑add functionality.",
  "frontend/src/startup/previewDiagnostics.ts": "Startup diagnostics utility that collects early load errors and displays an overlay if critical issues occur.",
  "frontend/src/utils/analytics.ts": "Google Analytics helper functions for safe gtag event tracking including play, pause, and cast events.",
  "frontend/src/utils/ics.ts": "Generates an ICS calendar file for a show by computing next occurrence and triggering a file download.",
  "frontend/src/utils/normalizeArtworkUrl.ts": "Normalizes artwork URLs, converting relative or protocol-relative paths to HTTPS and validating absolute URLs.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, screens, animations, plugins, and theme extensions.",
  "project_state.json": "Contains project metadata, feature definitions, requirements, and background image asset specifications."
}