{
  "backend/main.mo": "Motoko canister handling user profiles, push subscriptions, radio stream checks, and request logging with access-control enforcement.",
  "feature_evidence.json": "Feature evidence record linking a UI change to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing various frontend files and their functionality.",
  "frontend/DEPLOYMENT_DEBUG.md": "Debug notes outlining a TypeScript build failure caused by Node.js typings in the frontend.",
  "frontend/index.html": "Main HTML entry point configuring PWA meta tags, Google Cast SDK, and a fallback recovery UI for slow app mounts.",
  "frontend/public/manifest.json": "PWA manifest defining metadata, theme colors, icons, and shortcuts for Mawalking Radio.",
  "frontend/public/service-worker.js": "Service worker managing caching, activation cleanup, and push notification handling with versioned caches.",
  "frontend/README-verify.md": "Brief guide describing how to run the frontend verification script.",
  "frontend/scripts/verify-frontend.mjs": "Node.js script that checks for browser-incompatible typings, runs TypeScript checks, and validates asset paths before deployment.",
  "frontend/src/App.tsx": "Main app component managing playback state, navigation, notifications, and error boundaries for the radio app. Includes global hooks, screen routing, and UI-level error handling.",
  "frontend/src/components/CastControl.tsx": "Chromecast control button that starts or stops casting the stream and shows connection status. Tracks cast events and displays toast feedback.",
  "frontend/src/components/InstallPrompt.tsx": "PWA install prompt logic handling iOS/Android detection, beforeinstallprompt events, and dismissal timers. Shows platform-specific installation guides when appropriate.",
  "frontend/src/components/navigation/BottomTabNav.tsx": "Renders a mobile bottom tab bar with Home, Shows, and Settings navigation.",
  "frontend/src/components/player/MiniPlayer.tsx": "Shows a compact player with album art, track info, and play/pause control.",
  "frontend/src/components/player/VolumeSlider.tsx": "Provides a slider UI to control and sync audio element volume.",
  "frontend/src/components/PushNotificationsPanel.tsx": "Panel for enabling and displaying the status of web push notifications, including subscription flow and error handling.",
  "frontend/src/components/RequestForm.tsx": "Modal form for submitting song or shout‑out requests, with validation, mutation handling, and success/error toasts.",
  "frontend/src/components/ServiceWorkerRecoveryBanner.tsx": "Banner alert offering refresh or reset options when a service worker update or loading error occurs.",
  "frontend/src/components/ShareButton.tsx": "Share button using the Web Share API with a fallback modal for copying the app link to the clipboard.",
  "frontend/src/components/shows/ShowCard.tsx": "Displays show details including image, description, genres, and schedule in a clickable card.",
  "frontend/src/components/status/LiveBadge.tsx": "Shows a red animated LIVE badge with a radio icon.",
  "frontend/src/components/status/OnAirIndicator.tsx": "Small pulsing dot indicating on‑air status.",
  "frontend/src/components/TrackNotification.tsx": "Displays a styled track notification with dynamic theming based on type and optional dismiss action.",
  "frontend/src/data/mockShows.ts": "Defines the Show interface and provides mock show data for testing.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to user identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useAlbumArtBackground.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useAppLifecyclePlaybackRecovery.ts": "Handles resuming audio playback after visibility, focus, or bfcache lifecycle changes.",
  "frontend/src/hooks/useChromecast.tsx": "Manages Chromecast API initialization, session handling, and casting state for a stream URL.",
  "frontend/src/hooks/useFavoriteStation.ts": "Stores and toggles a boolean favorite state in localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling AuthClient setup, login flow, and stored identity restoration.",
  "frontend/src/hooks/useNotifications.ts": "Watches now playing metadata to detect track, mix, or live changes and triggers browser notifications with deduplication and permission handling.",
  "frontend/src/hooks/usePushSubscription.ts": "Manages Web Push subscription flow, including permission requests, service worker interaction, VAPID setup, and storing subscription data via backend actor.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for fetching the stream URL, checking availability, retrieving now-playing data, and a placeholder mutation for submitting requests.",
  "frontend/src/hooks/useServiceWorkerRegistration.ts": "Handles service worker registration, update checks, error tracking, and provides utilities to apply updates or fully reset the service worker and caches.",
  "frontend/src/hooks/useSleepTimer.ts": "Implements a sleep timer that counts down and pauses an audio element when time expires, with start and cancel controls.",
  "frontend/src/hooks/useWakeLock.ts": "React hook managing screen wake lock acquisition, release, and recovery on visibility changes.",
  "frontend/src/index.css": "Global Tailwind-based styling defining dark theme variables and responsive background/overlay behavior.",
  "frontend/src/main.tsx": "Application entry mounting React root with React Query and Internet Identity providers.",
  "frontend/src/screens/BrowseShowsScreen.tsx": "UI for browsing mock shows with genre and day filters and a selectable show list.",
  "frontend/src/screens/HomeLiveScreen.tsx": "Home screen displaying live radio status with play controls, error handling, and station info.",
  "frontend/src/screens/NowPlayingScreen.tsx": "Now Playing view showing track metadata, album art, play controls, volume, and sleep timer.",
  "frontend/src/screens/SettingsAboutScreen.tsx": "Settings screen providing notification controls, background-cache refresh, and about information.",
  "frontend/src/screens/ShowDetailScreen.tsx": "Renders a detailed view for a selected show with image, info, genres, and actions to add an event to the calendar or request reminders.",
  "frontend/src/startup/previewDiagnostics.ts": "Captures early startup errors, classifies critical ones, and displays a recovery overlay when thresholds are exceeded.",
  "frontend/src/utils/analytics.ts": "Provides safe wrappers for Google Analytics event tracking, including specific helpers for audio and casting events.",
  "frontend/src/utils/ics.ts": "Generates and downloads an ICS calendar file for a show by computing the next occurrence and formatting event data.",
  "frontend/src/utils/normalizeArtworkUrl.ts": "Normalizes raw artwork URLs into validated HTTPS URLs, handling relative and protocol‑relative forms.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters across query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, screens, animations, and theme settings for the frontend.",
  "project_state.json": "Project metadata describing features, requests, versions, and overall project state."
}