{
  "backend/main.mo": "Motoko canister managing access control, user profiles, radio stream checks, requests, and push subscription storage with permission-guarded queries and updates.",
  "feature_evidence.json": "Empty feature evidence report structure.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend components, hooks, configs, and service worker behavior.",
  "frontend/DEPLOYMENT_DEBUG.md": "Debug notes outlining TypeScript build failures caused by browser-incompatible Node.js typings in App.tsx.",
  "frontend/index.html": "Main HTML entry point with PWA metadata, icons, cast SDK, and a fallback recovery UI for slow React mounts.",
  "frontend/public/manifest.json": "PWA manifest defining metadata, icons, theme color, categories, and shortcuts for Mawalking Radio.",
  "frontend/public/service-worker.js": "Service worker handling caching, aggressive cleanup, and push notifications with versioned cache management.",
  "frontend/README-verify.md": "Guide for running the frontend verification script to detect build issues.",
  "frontend/scripts/verify-frontend.mjs": "Node script performing pre-deployment frontend checks for NodeJS.Timeout usage, TypeScript errors, and asset path validation.",
  "frontend/src/App.tsx": "Main app component handling playback state, navigation between screens, and global error boundary UI.",
  "frontend/src/components/CastControl.tsx": "Provides a Chromecast cast/stop button with status handling and analytics tracking.",
  "frontend/src/components/InstallPrompt.tsx": "Manages PWA install prompts and platform-specific install guides for iOS and Android.",
  "frontend/src/components/navigation/BottomTabNav.tsx": "Renders a fixed bottom navigation bar with Home, Shows, and Settings tabs and active-state handling.",
  "frontend/src/components/player/MiniPlayer.tsx": "Shows a compact audio player with album art, track info, and a play/pause button that opens the full player.",
  "frontend/src/components/player/VolumeSlider.tsx": "Implements a volume slider synced with an audio element and updates volume in real time.",
  "frontend/src/components/PushNotificationsPanel.tsx": "UI panel allowing users to enable or view the status of push notification subscriptions.",
  "frontend/src/components/RequestForm.tsx": "Modal form for submitting song or shoutout requests with validation and backend submission.",
  "frontend/src/components/ServiceWorkerRecoveryBanner.tsx": "Banner prompting the user to refresh or reset when service worker errors or updates occur.",
  "frontend/src/components/ShareButton.tsx": "Button for sharing app links using Web Share API with a fallback modal and copy-to-clipboard support.",
  "frontend/src/components/shows/ShowCard.tsx": "Displays a show card with image, description, genres, and schedule, clickable for details.",
  "frontend/src/components/status/LiveBadge.tsx": "Renders a red animated LIVE badge with a pulsing dot and radio icon.",
  "frontend/src/components/status/OnAirIndicator.tsx": "Shows a small pulsing dot indicating on-air status.",
  "frontend/src/components/TrackNotification.tsx": "Displays a styled music notification with dynamic appearance based on type and optional dismiss button.",
  "frontend/src/data/mockShows.ts": "Provides mock show data and TypeScript types for show listings.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAlbumArtBackground.ts": "Empty placeholder hook file.",
  "frontend/src/hooks/useAppLifecyclePlaybackRecovery.ts": "Handles resuming audio playback across visibility, focus, and bfcache events with fallback notifications.",
  "frontend/src/hooks/useChromecast.tsx": "Manages Chromecast API initialization, casting state, sessions, and error handling for a stream URL.",
  "frontend/src/hooks/useFavoriteStation.ts": "Tracks and toggles a favorite station flag using localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using AuthClient, handling login, logout, and stored identity restoration.",
  "frontend/src/hooks/useNotifications.ts": "Watches now-playing metadata to detect tracks, mixes, or live shows and triggers deduplicated browser notifications with permission handling.",
  "frontend/src/hooks/usePushSubscription.ts": "Manages Web Push subscription flow, requesting permission, registering with the service worker, and storing subscription details in the backend.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for stream URL retrieval, stream availability checks, now-playing data fetching, and submitting user requests.",
  "frontend/src/hooks/useServiceWorkerRegistration.ts": "Handles service worker registration, update detection, reset operations, and readiness tracking for the PWA environment.",
  "frontend/src/hooks/useSleepTimer.ts": "Implements a sleep timer that counts down and pauses audio playback when the timer expires.",
  "frontend/src/hooks/useWakeLock.ts": "React hook that manages acquiring, releasing, and restoring a screen wake lock based on activity and visibility changes.",
  "frontend/src/index.css": "Tailwind-based global styles defining dark theme color variables and responsive background/overlay behavior.",
  "frontend/src/main.tsx": "App entry point initializing React, React Query, Internet Identity provider, and global styles.",
  "frontend/src/screens/BrowseShowsScreen.tsx": "UI for browsing mock shows with genre and day filters and listing filtered results.",
  "frontend/src/screens/HomeLiveScreen.tsx": "Live radio home screen showing playback state, play/pause controls, and quick actions.",
  "frontend/src/screens/NowPlayingScreen.tsx": "Full-screen now‑playing view with album art, playback controls, volume, and sleep timer.",
  "frontend/src/screens/SettingsAboutScreen.tsx": "Settings screen with notification controls and a tool to refresh the cached background image.",
  "frontend/src/screens/ShowDetailScreen.tsx": "Displays detailed show info with image, metadata, and actions including generating an ICS calendar event and showing reminders.",
  "frontend/src/startup/previewDiagnostics.ts": "Captures early startup errors, classifies critical ones, and shows a recovery overlay if thresholds are exceeded.",
  "frontend/src/utils/analytics.ts": "Provides safe Google Analytics event helpers with gtag checks for playback, pause, and casting events.",
  "frontend/src/utils/ics.ts": "Generates and downloads ICS calendar files for shows, including date parsing and ICS formatting.",
  "frontend/src/utils/normalizeArtworkUrl.ts": "Validates and normalizes artwork URLs to safe HTTPS absolute paths, handling relative and malformed inputs.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, persisting, and clearing URL parameters across navigation using URLSearchParams and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, screens, animations, and theme tokens for the frontend UI.",
  "project_state.json": "Project state metadata describing current issues and a pending request to reduce background image font size."
}