{
  "backend/main.mo": "Actor providing user profiles, access-controlled requests, radio stream availability checks, and push subscription storage using http outcalls.",
  "feature_evidence.json": "Feature evidence file listing recent CSS background updates, affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file mapping frontend source paths to short descriptions of their purpose and recent updates.",
  "frontend/DEPLOYMENT_DEBUG.md": "Debug notes documenting a TypeScript build failure caused by Node.js typings in App.tsx.",
  "frontend/index.html": "HTML entry point configuring meta tags, PWA settings, Google Cast, and a fallback recovery UI for slow React mounts.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, theme colors, icons, and shortcuts.",
  "frontend/public/service-worker.js": "Service worker handling caching, versioned cleanup, offline behavior, and push notifications with background asset caching.",
  "frontend/README-verify.md": "Guide explaining how to run the frontend verification script before deployment.",
  "frontend/scripts/verify-frontend.mjs": "Node script that validates TypeScript config, checks for browser-incompatible code, and verifies asset references and service worker settings.",
  "frontend/src/App.tsx": "Main app component handling playback state, navigation views, error boundary, and integration with service worker, notifications, and various UI screens.",
  "frontend/src/components/CastControl.tsx": "No summary available.",
  "frontend/src/components/InstallPrompt.tsx": "PWA install prompt manager detecting device/browser conditions and showing install guides or triggering the install flow.",
  "frontend/src/components/navigation/BottomTabNav.tsx": "Displays a fixed bottom tab navigation bar that switches tabs using provided callbacks.",
  "frontend/src/components/player/MiniPlayer.tsx": "Shows a compact audio player with album art, marquee title, and play/pause control, opening the full player when clicked.",
  "frontend/src/components/player/TrackTitleMarquee.tsx": "Implements an accessible scrolling marquee for long track titles with pause, focus, and reduced‑motion handling.",
  "frontend/src/components/player/VolumeSlider.tsx": "Provides a slider UI for adjusting an audio element’s volume, syncing state with the referenced audio tag.",
  "frontend/src/components/PushNotificationsPanel.tsx": "Panel for enabling and displaying status of push notification subscription with error handling.",
  "frontend/src/components/RequestForm.tsx": "Modal form allowing users to submit song or shoutout requests with validation and backend submission.",
  "frontend/src/components/ServiceWorkerRecoveryBanner.tsx": "Banner prompting users to refresh or reset the app when updates or service worker errors occur.",
  "frontend/src/components/ShareButton.tsx": "Button for sharing the app using Web Share API with fallback modal and clipboard copy support.",
  "frontend/src/components/shows/ShowCard.tsx": "Displays a show’s image, details, genres, and schedule in a clickable card layout.",
  "frontend/src/components/status/LiveBadge.tsx": "Renders a red LIVE badge with pulsing indicator and radio icon.",
  "frontend/src/components/status/OnAirIndicator.tsx": "Shows a small pulsing accent-colored on‑air indicator dot.",
  "frontend/src/components/TrackNotification.tsx": "Renders a styled track notification with different visual themes based on notification type and optional dismiss handling.",
  "frontend/src/data/mockShows.ts": "Defines the Show interface and provides mock show data used for UI display.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user’s identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAlbumArtBackground.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useAppLifecyclePlaybackRecovery.ts": "Handles auto‑resuming audio playback when returning from hidden, focus, or bfcache states, notifying parent if manual resume is required.",
  "frontend/src/hooks/useChromecast.tsx": "Manages Chromecast availability, initialization, session handling, and media casting state for a given stream URL. Tracks device status, errors, and casting lifecycle via the Cast SDK.",
  "frontend/src/hooks/useFavoriteStation.ts": "Stores and toggles a favorite-station flag in localStorage. Provides simple favorite state and updater.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context for Internet Identity authentication, handling identity loading, login flow, and status tracking. Wraps AuthClient setup and exposes login and clear actions.",
  "frontend/src/hooks/useMarqueeMeasurements.ts": "Measures container and text widths to determine overflow and compute marquee animation properties. Recalculates distance, duration, and remount key for smooth scrolling.",
  "frontend/src/hooks/useNotifications.ts": "Determines notification eligibility and triggers track, mix, or live notifications based on now‑playing metadata with deduplication. Manages permission requests, timing, and current notification state.",
  "frontend/src/hooks/usePushSubscription.ts": "Handles push notification subscription via Service Worker and PushManager, including permission requests and backend registration. Tracks subscription state, errors, and provides subscribe/unsubscribe actions.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching the stream URL with fallback, checking stream availability, retrieving now-playing data, and submitting (future) requests.",
  "frontend/src/hooks/useServiceWorkerRegistration.ts": "Manages service worker registration, update detection, reset logic, and related state handling.",
  "frontend/src/hooks/useSleepTimer.ts": "Implements a countdown sleep timer that pauses the audio element when time expires.",
  "frontend/src/hooks/useWakeLock.ts": "Handles requesting and releasing a screen wake lock based on activity and visibility changes.",
  "frontend/src/index.css": "Defines global Tailwind styles, theme variables, responsive background images, and layout/base styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider, rendering App.",
  "frontend/src/screens/BrowseShowsScreen.tsx": "Renders a show browser with genre/day filters and clickable show cards using mock data.",
  "frontend/src/screens/HomeLiveScreen.tsx": "Displays the home live radio screen with station branding, playback controls, and live status indicators.",
  "frontend/src/screens/NowPlayingScreen.tsx": "Shows detailed now-playing info with album art, playback controls, sleep timer, and sharing options.",
  "frontend/src/screens/SettingsAboutScreen.tsx": "Provides app settings including notifications and a tool to refresh cached background images.",
  "frontend/src/screens/ShowDetailScreen.tsx": "Displays show details with image, schedule, genres, description, and options to add to calendar or set reminders.",
  "frontend/src/startup/previewDiagnostics.ts": "Captures and displays early startup errors, determining critical issues and optionally showing a recovery overlay.",
  "frontend/src/utils/analytics.ts": "Utility wrapper for safe Google Analytics event tracking, including playback and casting events.",
  "frontend/src/utils/ics.ts": "Generates and downloads an ICS calendar file for a show, including date parsing and formatting helpers.",
  "frontend/src/utils/normalizeArtworkUrl.ts": "Normalizes raw artwork URLs into valid HTTPS URLs, handling relative, protocol-relative, and malformed inputs.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, and clearing URL parameters with sessionStorage support and hash routing handling.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, plugins, custom colors, breakpoints, animations, and container settings.",
  "project_state.json": "Stores project metadata, feature requests, versions, and architectural notes for build planning."
}