{
  "backend/main.mo": "Actor implementing access‑controlled user profiles, push notification subscriptions, radio stream checks, and request logging using Map/List storage and http outcalls.",
  "feature_evidence.json": "Feature evidence report describing required CSS background‑position updates and listing affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Collection of frontend file summaries describing component behavior, hooks, styling, and PWA functionality.",
  "frontend/DEPLOYMENT_DEBUG.md": "Debug notes documenting a frontend TypeScript build failure caused by Node.js typings in browser code.",
  "frontend/index.html": "HTML entry point defining metadata, PWA configuration, Google Cast SDK loading, and a React mount timeout recovery UI.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, theme color, icons, categories, and shortcuts.",
  "frontend/public/service-worker.js": "Service worker handling caching, activation cleanup, background asset prefetching, and push notification display.",
  "frontend/README-verify.md": "Guide for running the frontend verification script to detect build‑breaking issues locally.",
  "frontend/scripts/verify-frontend.mjs": "Node script verifying TypeScript config presence, NodeJS.Timeout usage, background asset paths, and service‑worker configuration.",
  "frontend/src/App.tsx": "Main app component managing navigation, playback state, error boundaries, and lifecycle hooks for streaming and PWA behaviors.",
  "frontend/src/components/CastControl.tsx": "Chromecast control button allowing users to start or stop casting the current stream and tracking cast events.",
  "frontend/src/components/InstallPrompt.tsx": "PWA install prompt logic handling platform detection, browser events, and guided installation flows for iOS and Android.",
  "frontend/src/components/navigation/BottomTabNav.tsx": "Renders a bottom tab bar with Home, Shows, and Settings tabs, highlighting the active one.",
  "frontend/src/components/player/MiniPlayer.tsx": "Shows a compact player with album art, scrolling title, artist, and a play/pause button, and opens the full player on tap.",
  "frontend/src/components/player/TrackTitleMarquee.tsx": "Implements an accessible marquee text component with pause, focus, and reduced-motion handling.",
  "frontend/src/components/player/VolumeSlider.tsx": "Provides a volume slider tied to an audio element, syncing and updating its volume.",
  "frontend/src/components/PushNotificationsPanel.tsx": "UI panel for enabling and displaying push notification subscription status with error handling.",
  "frontend/src/components/RequestForm.tsx": "Dialog form for submitting song or shoutout requests with validation and backend submission handling.",
  "frontend/src/components/ServiceWorkerRecoveryBanner.tsx": "Banner prompting users to refresh or reset the app when updates are available or service worker errors occur.",
  "frontend/src/components/ShareButton.tsx": "Share button using the Web Share API with a fallback modal for copying the app link.",
  "frontend/src/components/shows/ShowCard.tsx": "Displays a show card with image, title, description, genres, and schedule, triggering a click handler.",
  "frontend/src/components/status/LiveBadge.tsx": "Renders a pulsating red LIVE badge with an icon for indicating live status.",
  "frontend/src/components/status/OnAirIndicator.tsx": "Shows a small pulsing dot used to indicate on‑air status.",
  "frontend/src/components/TrackNotification.tsx": "Displays a configurable track notification with icon, colors, title, artist, and an optional dismiss button.",
  "frontend/src/data/mockShows.ts": "Defines the Show interface and provides mock show data for display in the app.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useAlbumArtBackground.ts": "Empty placeholder hook with no implementation.",
  "frontend/src/hooks/useAppLifecyclePlaybackRecovery.ts": "Handles auto‑resuming audio playback on visibility changes, focus events, and bfcache restores, notifying when manual resume is needed.",
  "frontend/src/hooks/useChromecast.tsx": "Manages Chromecast availability, initialization, session handling, and casting state for a given stream URL.",
  "frontend/src/hooks/useFavoriteStation.ts": "Tracks and toggles a single favorite station flag persisted in localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context for Internet Identity login, identity loading, and status management using Dfinity AuthClient.",
  "frontend/src/hooks/useMarqueeMeasurements.ts": "Measures container and text widths to determine overflow and compute marquee animation properties.",
  "frontend/src/hooks/useNotifications.ts": "Generates browser notifications for track, mix, or live metadata changes with deduplication and permission handling.",
  "frontend/src/hooks/usePushSubscription.ts": "Handles Push API subscription flow, permission requests, and storing subscription details via backend actor.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching stream URLs with fallback logic, checking stream availability, fetching now‑playing metadata, and submitting user requests.",
  "frontend/src/hooks/useServiceWorkerRegistration.ts": "Manages service worker registration, update handling, error tracking, and provides a reset mechanism for caches and storage.",
  "frontend/src/hooks/useSleepTimer.ts": "Implements a countdown sleep timer that pauses an audio element when time expires.",
  "frontend/src/hooks/useWakeLock.ts": "Handles requesting and releasing the screen wake lock based on activity state, with visibility‑change re‑request logic.",
  "frontend/src/index.css": "Defines global Tailwind styles, theme variables, responsive background images, safe‑area utilities, and layout structure.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/screens/BrowseShowsScreen.tsx": "Renders a filterable list of shows with genre and day selectors, displaying ShowCards or a no‑results state.",
  "frontend/src/screens/HomeLiveScreen.tsx": "Displays the main live radio screen with station branding, playback controls, and live status handling including loading and error states.",
  "frontend/src/screens/NowPlayingScreen.tsx": "Shows detailed now‑playing info with album art, playback controls, volume, sleep timer, and sharing options.",
  "frontend/src/screens/SettingsAboutScreen.tsx": "Provides settings for notifications and background image cache refresh with UI cards and refresh handling.",
  "frontend/src/screens/ShowDetailScreen.tsx": "Displays detailed information for a selected show with image, metadata, and actions like adding to calendar.",
  "frontend/src/startup/previewDiagnostics.ts": "Captures early startup errors and conditionally shows a diagnostics overlay summarizing critical failures.",
  "frontend/src/utils/analytics.ts": "Utility for safely sending Google Analytics events, including playback and casting‑related tracking.",
  "frontend/src/utils/ics.ts": "Builds and downloads a calendar (.ics) file for a show by computing its next occurrence and formatting timestamps.",
  "frontend/src/utils/normalizeArtworkUrl.ts": "Normalizes artwork URLs into valid HTTPS absolute URLs, handling relative and malformed inputs.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, storing them in sessionStorage, and managing persisted values.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, screens, animations, and theme settings with custom variables.",
  "project_state.json": "Stores project metadata, feature definitions, and pending feature requests for build state tracking."
}