{
  "backend/main.mo": "Motoko canister providing access-controlled user profiles, push notification subscriptions, radio stream checks, and request logging using http-outcalls.",
  "feature_evidence.json": "Feature evidence report linking the continuous playback user-intent system to affected frontend files and test requirements.",
  "frontend-file-summaries.txt": "Prewritten summary list describing functionality of various frontend files including hooks, components, and configuration.",
  "frontend/DEPLOYMENT_DEBUG.md": "Notes documenting a rollback to version 99 and listing reverted UI and service worker changes.",
  "frontend/index.html": "Main HTML entry point defining PWA metadata, icons, theme color, and loading the React app.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, theme, icons, and shortcuts for launching live playback.",
  "frontend/public/service-worker.js": "Service worker implementing versioned static asset caching and network-first navigation handling.",
  "frontend/README-verify.md": "Short guide explaining how to run the frontend verification script during development.",
  "frontend/scripts/verify-frontend.mjs": "Node script that validates TypeScript config, background assets, and service worker references before deployment.",
  "frontend/src/App.tsx": "Main React component managing navigation, audio playback state, and user-intent-based recovery logic with integrated hooks.",
  "frontend/src/components/CastControl.tsx": "Chromecast control button enabling users to start or stop casting the audio stream with status feedback.",
  "frontend/src/components/InstallPrompt.tsx": "Manages PWA installation prompts and platform-specific guides based on device, browser, and dismissal history.",
  "frontend/src/components/navigation/BottomTabNav.tsx": "Displays a fixed bottom navigation bar for switching between home, browse, and settings tabs.",
  "frontend/src/components/player/MiniPlayer.tsx": "Compact audio player showing artwork, title marquee, and play/pause controls with click-to-open behavior.",
  "frontend/src/components/player/TrackTitleMarquee.tsx": "Scrolling marquee component for track titles with motion preferences, pause interactions, and measurement-based animation.",
  "frontend/src/components/player/VolumeSlider.tsx": "Volume slider synced with an audio element and updates its volume in real time.",
  "frontend/src/components/PushNotificationsPanel.tsx": "Displays push notification status and subscription controls using a custom hook.",
  "frontend/src/components/RequestForm.tsx": "Provides a dialog form for submitting song or shoutout requests with validation and backend submission handling.",
  "frontend/src/components/ServiceWorkerRecoveryBanner.tsx": "Shows a banner prompting users to refresh or reset the app when an update or service worker error occurs.",
  "frontend/src/components/ShareButton.tsx": "Implements a share button using the Web Share API with a fallback modal for copying a link.",
  "frontend/src/components/shows/ShowCard.tsx": "Card UI displaying show metadata including image, description, genres, and schedule with click handling.",
  "frontend/src/components/status/LiveBadge.tsx": "Visual badge indicating live status with animated ping and icon.",
  "frontend/src/components/status/OnAirIndicator.tsx": "Small animated pulsing indicator used to show on‑air status.",
  "frontend/src/components/TrackNotification.tsx": "Renders styled in-app notifications for live shows, mixes, or tracks with dismiss support.",
  "frontend/src/data/mockShows.ts": "Mock dataset defining Show interface and sample show entries.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor instance based on authenticated identity, invalidating dependent queries when updated.",
  "frontend/src/hooks/useAlbumArtBackground.ts": "Empty placeholder file for album‑art background logic.",
  "frontend/src/hooks/useAppLifecyclePlaybackRecovery.ts": "Hook that restores audio playback after visibility, focus, or bfcache lifecycle events when the user expects playback.",
  "frontend/src/hooks/useBackgroundImageDiagnostics.ts": "Diagnostic hook that verifies background image loading and logs warnings if missing.",
  "frontend/src/hooks/useChromecast.tsx": "Hook implementing Chromecast session initialization, device availability detection, and media casting management.",
  "frontend/src/hooks/useElementCallbackRef.ts": "Provides a stable callback ref and returns the currently mounted DOM element.",
  "frontend/src/hooks/useFavoriteStation.ts": "Manages a favorite flag synced with localStorage and exposes a toggle function.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identities, and status tracking.",
  "frontend/src/hooks/useKeyboardFocusIntent.ts": "Tracks keyboard navigation intent based on key and pointer events, resetting after inactivity.",
  "frontend/src/hooks/useMarqueeMeasurements.ts": "Measures container/text sizes to determine overflow and compute marquee animation properties.",
  "frontend/src/hooks/useNotifications.ts": "Manages notification permission, detects track/mix/live changes, and triggers deduplicated notifications.",
  "frontend/src/hooks/usePushSubscription.ts": "Handles push subscription flow using service workers and stores subscription data via backend actor.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for stream URL, availability checks, now-playing data, and request submission.",
  "frontend/src/hooks/useServiceWorkerRegistration.ts": "Manages service worker registration, update handling, cache reset, and readiness state with detailed error-tolerant logic.",
  "frontend/src/hooks/useSleepTimer.ts": "Provides a countdown timer that pauses audio when time elapses and supports starting or canceling the timer.",
  "frontend/src/hooks/useStreamInterruptionRecovery.ts": "Implements automatic audio stream recovery using retry logic, exponential backoff, and stall/error detection.",
  "frontend/src/hooks/useWakeLock.ts": "Requests and manages a screen wake lock while active, automatically re-requesting on visibility changes and cleaning up on unmount.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, background styles, responsive helpers, marquee animation, and safe-area utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and mounts the root component.",
  "frontend/src/screens/BrowseShowsScreen.tsx": "Renders a shows browsing screen with genre/day filters and a list of selectable show cards.",
  "frontend/src/screens/HomeLiveScreen.tsx": "Renders the main live stream screen with playback controls, status indicators, and station header UI. Handles play/pause behavior, loading states, and favorite toggling.",
  "frontend/src/screens/NowPlayingScreen.tsx": "Displays detailed now-playing info with album art, track metadata, volume control, sleep timer, and playback controls. Supports closing the screen and managing a sleep timer overlay.",
  "frontend/src/screens/SettingsAboutScreen.tsx": "Provides settings and about page UI with notification controls and a background-image refresh feature. Clears cached background assets and triggers reload on refresh.",
  "frontend/src/screens/ShowDetailScreen.tsx": "Shows detailed info for a scheduled show, including image, schedule, genres, and description. Allows adding the show to a calendar and displays a reminder placeholder action.",
  "frontend/src/startup/previewDiagnostics.ts": "Captures and aggregates early startup errors, determines critical failures, and triggers a recovery overlay if needed. Provides summary utilities for diagnostics reporting.",
  "frontend/src/utils/analytics.ts": "Utility for safe Google Analytics event tracking with checks for gtag availability. Includes helpers for play, pause, and casting event tracking with metadata.",
  "frontend/src/utils/ics.ts": "Generates an .ics calendar file for a show by computing the next show date, formatting timestamps, and triggering a download.",
  "frontend/src/utils/normalizeArtworkUrl.ts": "Validates and normalizes artwork URLs, handling relative, protocol‑relative, and absolute HTTPS URLs, returning null if invalid.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL params (including from hashes), storing them in sessionStorage, and retrieving persisted values.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme extensions, colors, screens, animations, and plugins for the frontend.",
  "project_state.json": "Defines the project state, including feature summaries, pending requests, metadata, and version information."
}