{
  "backend/main.mo": "Motoko canister implementing access‑controlled user profiles, push subscriptions, radio stream checks, and request logging using OutCalls and Maps.",
  "feature_evidence.json": "Feature evidence report listing two marquee‑related features with associated files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "JSON-style list of concise summaries for many frontend source files and their roles in the app.",
  "frontend/DEPLOYMENT_DEBUG.md": "Notes describing a frontend TypeScript build failure caused by browser‑incompatible Node.js typings in App.tsx.",
  "frontend/index.html": "Main HTML document configuring PWA metadata, icons, Google Cast SDK, and a fallback recovery UI if React fails to mount.",
  "frontend/public/manifest.json": "PWA manifest defining app name, icons, theme colors, categories, and shortcuts for Mawalking Radio.",
  "frontend/public/service-worker.js": "Service worker implementing versioned caching, aggressive cache cleanup, asset prefetching, and push notification handling.",
  "frontend/README-verify.md": "Guide explaining how to run the frontend verification script to detect issues before deployment.",
  "frontend/scripts/verify-frontend.mjs": "Node script that checks for NodeJS.Timeout usage, runs TypeScript checks, and validates asset paths before deployment.",
  "frontend/src/App.tsx": "Main application component with routing, playback state, lifecycle handlers, and an error boundary for UI recovery.",
  "frontend/src/components/CastControl.tsx": "Chromecast control button that starts or stops casting and provides UI feedback with analytics tracking.",
  "frontend/src/components/InstallPrompt.tsx": "Handles PWA install prompts and platform‑specific install guides with dismissal logic.",
  "frontend/src/components/navigation/BottomTabNav.tsx": "Renders a bottom navigation bar with Home, Shows, and Settings tabs and handles tab switching.",
  "frontend/src/components/player/MiniPlayer.tsx": "Shows a compact music player with album art, scrolling title, play/pause control, and navigation to the full player.",
  "frontend/src/components/player/TrackTitleMarquee.tsx": "Provides an auto-scrolling marquee for long track titles with pause and accessibility handling.",
  "frontend/src/components/player/VolumeSlider.tsx": "Controls and syncs audio element volume using a slider component.",
  "frontend/src/components/PushNotificationsPanel.tsx": "UI panel to enable and display status of push notification subscriptions with error handling.",
  "frontend/src/components/RequestForm.tsx": "Modal form for submitting song or shoutout requests with validation and async submission.",
  "frontend/src/components/ServiceWorkerRecoveryBanner.tsx": "Banner prompting the user to refresh or reset when a service worker update or load error occurs.",
  "frontend/src/components/ShareButton.tsx": "Share button using the Web Share API with a fallback dialog for copying a shareable link.",
  "frontend/src/components/shows/ShowCard.tsx": "Displays a show’s image, details, genres, and schedule in a clickable card.",
  "frontend/src/components/status/LiveBadge.tsx": "Shows a red LIVE badge with pulsing indicator and radio icon.",
  "frontend/src/components/status/OnAirIndicator.tsx": "Renders a small pulsing dot indicating on‑air status.",
  "frontend/src/components/TrackNotification.tsx": "Displays customizable track notifications with icons, styling, and an optional dismiss button based on notification type.",
  "frontend/src/data/mockShows.ts": "Provides mock show data and the Show interface for development use.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useAlbumArtBackground.ts": "Empty placeholder hook file.",
  "frontend/src/hooks/useAppLifecyclePlaybackRecovery.ts": "Restores audio playback after visibility, focus, or bfcache lifecycle events and triggers manual resume when needed.",
  "frontend/src/hooks/useChromecast.tsx": "Manages Chromecast API initialization, session handling, and casting state for a given stream URL.",
  "frontend/src/hooks/useFavoriteStation.ts": "Tracks and toggles a single favorite station flag in localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context for Internet Identity authentication, including login, logout, and persisted identities.",
  "frontend/src/hooks/useMarqueeMeasurements.ts": "Calculates overflow-based marquee animation properties by measuring container and text widths.",
  "frontend/src/hooks/useNotifications.ts": "Determines when to show browser notifications for track, mix, or live changes with deduplication and permission handling.",
  "frontend/src/hooks/usePushSubscription.ts": "Handles push notification subscription lifecycle using a service worker and backend storage.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching the stream URL with fallback logic, checking stream availability, fetching now playing data, and submitting requests.",
  "frontend/src/hooks/useServiceWorkerRegistration.ts": "Manages service worker registration, update handling, reset operations, and related state via a custom hook.",
  "frontend/src/hooks/useSleepTimer.ts": "Implements a sleep timer that counts down and pauses audio when time expires.",
  "frontend/src/hooks/useWakeLock.ts": "Handles requesting and releasing the screen wake lock based on playback activity and page visibility.",
  "frontend/src/index.css": "Defines Tailwind layers, theme variables, background assets, responsive background behavior, and global layout styles.",
  "frontend/src/main.tsx": "Bootstraps the app with React, sets up React Query, Internet Identity provider, and loads global styles.",
  "frontend/src/screens/BrowseShowsScreen.tsx": "Displays a filterable list of mock shows with genre and day filters and navigates to selected shows.",
  "frontend/src/screens/HomeLiveScreen.tsx": "UI for the live home screen showing station header, now-playing info, and a dynamic play/pause button with loading and error states.",
  "frontend/src/screens/NowPlayingScreen.tsx": "Displays expanded now‑playing view with album art, track info, playback controls, volume slider, and sleep timer options.",
  "frontend/src/screens/SettingsAboutScreen.tsx": "Settings page with push notification controls, background‑image cache refresh logic, and general about information.",
  "frontend/src/screens/ShowDetailScreen.tsx": "Show details screen displaying show metadata, schedule, image, and actions like downloading an ICS calendar event.",
  "frontend/src/startup/previewDiagnostics.ts": "Startup diagnostics collector that logs early script/resource errors and displays a recovery overlay if critical issues occur.",
  "frontend/src/utils/analytics.ts": "Utility wrapper for safe Google Analytics event tracking, providing helpers for playback and casting events.",
  "frontend/src/utils/ics.ts": "Generates an ICS calendar file for a show by computing the next occurrence and downloading it as a blob.",
  "frontend/src/utils/normalizeArtworkUrl.ts": "Normalizes artwork URLs, enforcing HTTPS and resolving relative or malformed inputs to absolute URLs.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, breakpoints, animations, and plugin usage.",
  "project_state.json": "Project state metadata describing context, known issues, and existing feature requests for fixing marquee scrolling."
}