{
  "backend/main.mo": "Motoko canister with access‑controlled user profiles, push subscriptions, radio stream checks, and request logging.",
  "feature_evidence.json": "Feature evidence report describing a CSS background-size update affecting frontend/src/index.css.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files detailing components, hooks, styles, and PWA behavior.",
  "frontend/DEPLOYMENT_DEBUG.md": "Notes the frontend TypeScript build failure and identifies lines in App.tsx causing browser-incompatible Node.js typings.",
  "frontend/index.html": "HTML entry point with PWA metadata, icons, Google Cast SDK, and a fallback recovery UI for React mount timeouts.",
  "frontend/public/manifest.json": "PWA manifest describing app metadata, icons, theme colors, categories, and shortcuts.",
  "frontend/public/service-worker.js": "Service worker handling caching, cache cleanup, and push notifications with versioned static and background assets.",
  "frontend/README-verify.md": "Guide explaining how to run the frontend verification script to detect build-breaking issues.",
  "frontend/scripts/verify-frontend.mjs": "Node verification script checking TS config presence, NodeJS.Timeout misuse, background asset paths, and service worker configuration.",
  "frontend/src/App.tsx": "Main app component managing navigation, playback state, service worker handling, and global error boundaries.",
  "frontend/src/components/CastControl.tsx": "Chromecast control button allowing users to start or stop casting the audio stream and tracking cast events.",
  "frontend/src/components/InstallPrompt.tsx": "PWA installation prompt logic detecting platform/browser conditions and showing install or guide modals.",
  "frontend/src/components/navigation/BottomTabNav.tsx": "Displays a fixed bottom tab bar with three tabs and handles tab switching.",
  "frontend/src/components/player/MiniPlayer.tsx": "Shows a compact audio player with artwork, title marquee, and play/pause controls.",
  "frontend/src/components/player/TrackTitleMarquee.tsx": "Implements an auto-scrolling marquee for long track titles with motion preferences and interaction pausing.",
  "frontend/src/components/player/VolumeSlider.tsx": "Provides a slider to control and sync audio element volume.",
  "frontend/src/components/PushNotificationsPanel.tsx": "Panel for enabling and displaying status of web push notifications with subscription handling.",
  "frontend/src/components/RequestForm.tsx": "Modal form for submitting song or shout‑out requests with validation and backend submission.",
  "frontend/src/components/ServiceWorkerRecoveryBanner.tsx": "Banner prompting users to refresh or reset when service worker errors or updates occur.",
  "frontend/src/components/ShareButton.tsx": "Share button using Web Share API with fallback modal and clipboard copy support.",
  "frontend/src/components/shows/ShowCard.tsx": "Displays a show card with image, description, genres, and schedule, clickable for details.",
  "frontend/src/components/status/LiveBadge.tsx": "Shows a red animated LIVE badge with a radio icon.",
  "frontend/src/components/status/OnAirIndicator.tsx": "Renders a small pulsing dot indicating on‑air status.",
  "frontend/src/components/TrackNotification.tsx": "Renders a styled track notification with icons and colors based on type and supports dismissing.",
  "frontend/src/data/mockShows.ts": "Contains the Show interface and a mock list of show data used for display.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAlbumArtBackground.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useAppLifecyclePlaybackRecovery.ts": "Handles auto-resuming audio playback on visibility, focus, and page restore events, notifying when manual resume is needed.",
  "frontend/src/hooks/useChromecast.tsx": "React hook managing Chromecast availability, initialization, sessions, and casting state for a given stream URL. Handles API readiness, session events, and connection/casting error states.",
  "frontend/src/hooks/useFavoriteStation.ts": "Simple hook that stores and toggles a boolean favorite flag in localStorage. Initializes state from storage and updates it on toggle.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing ICP Internet Identity login, stored identities, and auth-client lifecycle. Exposes login, logout, status flags, and the resolved identity.",
  "frontend/src/hooks/useMarqueeMeasurements.ts": "Computes overflow, animation distance, duration, and remount keys for scrolling marquee text based on container and text measurements. Uses layout effects and retries to ensure accurate DOM sizing.",
  "frontend/src/hooks/useNotifications.ts": "Tracks now‑playing metadata to detect track, mix, or live transitions and triggers deduplicated browser notifications. Manages notification permission, throttling, and current notification state.",
  "frontend/src/hooks/usePushSubscription.ts": "Manages push subscription state using a service worker and backend actor, handling permission requests, new or existing subscriptions, and unsubscribe operations. Stores subscription data in the backend after successful registration.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching stream URLs, checking availability, now-playing data, and submitting requests with fallbacks and retries.",
  "frontend/src/hooks/useServiceWorkerRegistration.ts": "Manages service worker registration, update handling, reset logic, and related state tracking.",
  "frontend/src/hooks/useSleepTimer.ts": "Implements a countdown sleep timer that pauses audio and exposes controls to start or cancel it.",
  "frontend/src/hooks/useWakeLock.ts": "Handles requesting and releasing the screen wake lock based on activity and visibility changes.",
  "frontend/src/index.css": "Defines Tailwind layers, theme variables, background images, layout resets, and global styling utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and renders the root component.",
  "frontend/src/screens/BrowseShowsScreen.tsx": "Renders a shows browsing UI with genre/day filters and a list of selectable show cards.",
  "frontend/src/screens/HomeLiveScreen.tsx": "Displays the main live radio screen with station branding, playback controls, and status indicators such as on‑air, loading, and errors.",
  "frontend/src/screens/NowPlayingScreen.tsx": "Shows detailed now‑playing info including album art, track metadata, playback controls, volume, share options, and a sleep timer.",
  "frontend/src/screens/SettingsAboutScreen.tsx": "Provides settings for notifications and background image refresh, including cache clearing and service worker interaction.",
  "frontend/src/screens/ShowDetailScreen.tsx": "Renders detailed information for a selected show with genres, schedule, description, and calendar/reminder actions.",
  "frontend/src/startup/previewDiagnostics.ts": "Captures early startup errors, classifies critical issues, and displays a recovery overlay when thresholds are met.",
  "frontend/src/utils/analytics.ts": "Utility helpers for safe Google Analytics event tracking, including play, pause, and casting events.",
  "frontend/src/utils/ics.ts": "Generates an ICS calendar file for a show by computing next show time, formatting dates, and triggering a file download.",
  "frontend/src/utils/normalizeArtworkUrl.ts": "Normalizes artwork URLs by handling relative, protocol-relative, and absolute paths while enforcing HTTPS.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, and clearing URL parameters with support for hash routing and session persistence.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, screens, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Describes the project state, versions, and feature requests related to adjusting global CSS background-size behavior."
}