{
  "backend/main.mo": "Actor implementing access-controlled user profiles, push subscriptions, radio stream checks, and request logging using Map, List, and HTTP outcalls.",
  "feature_evidence.json": "Feature evidence report mapping a marquee speed adjustment feature to affected files, components, tests, and confidence.",
  "frontend-file-summaries.txt": "JSON-style list of frontend file paths with detailed descriptions of each file’s purpose and functionality.",
  "frontend/DEPLOYMENT_DEBUG.md": "Debug notes describing a TypeScript build failure caused by Node.js typings in frontend code.",
  "frontend/index.html": "Main HTML entry with PWA metadata, icons, Google Cast SDK, and a React mount timeout recovery UI.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, icons, theme color, categories, and shortcuts.",
  "frontend/public/service-worker.js": "Service worker handling caching, activation cleanup, background asset caching, and push notifications.",
  "frontend/README-verify.md": "Guide explaining how to run the frontend verification script to detect build-breaking issues.",
  "frontend/scripts/verify-frontend.mjs": "Node-based script that checks for TypeScript config, banned NodeJS.Timeout usage, background asset correctness, and service worker asset references.",
  "frontend/src/App.tsx": "Main app component managing navigation, audio playback state, background diagnostics, service worker recovery, and query initialization.",
  "frontend/src/components/CastControl.tsx": "Provides a Chromecast toggle button using useChromecast to start or stop casting and display device/connection status.",
  "frontend/src/components/InstallPrompt.tsx": "Handles PWA installation prompts with platform detection, dismissal logic, and fallback guides for iOS and Android.",
  "frontend/src/components/navigation/BottomTabNav.tsx": "Renders a fixed bottom navigation bar with tabs for home, browse, and settings, handling active state and tab changes.",
  "frontend/src/components/player/MiniPlayer.tsx": "Provides a compact audio player with track info, album art, and play/pause controls, opening the full player when tapped.",
  "frontend/src/components/player/TrackTitleMarquee.tsx": "Animates long track titles with a marquee effect, supporting motion preferences and pointer/keyboard interaction to pause scrolling.",
  "frontend/src/components/player/VolumeSlider.tsx": "Implements a volume slider synced with an audio element, updating both UI state and audio volume.",
  "frontend/src/components/PushNotificationsPanel.tsx": "UI panel for enabling and managing push notification subscriptions with status, errors, and subscribe flow.",
  "frontend/src/components/RequestForm.tsx": "Dialog form allowing users to submit song or shoutout requests via useSubmitRequest with validation and toasts.",
  "frontend/src/components/ServiceWorkerRecoveryBanner.tsx": "Banner prompting users to refresh or reset the app when updates or load errors are detected.",
  "frontend/src/components/ShareButton.tsx": "Share button using Web Share API with a fallback modal for manual URL copying and clipboard support.",
  "frontend/src/components/shows/ShowCard.tsx": "Displays show info including image, title, description, genres, and schedule in a clickable card layout.",
  "frontend/src/components/status/LiveBadge.tsx": "Shows a red LIVE badge with a pulsing dot and radio icon.",
  "frontend/src/components/status/OnAirIndicator.tsx": "Renders a small pulsing accent-colored dot indicating on-air status.",
  "frontend/src/components/TrackNotification.tsx": "Displays a styled music notification with icons and colors based on type, showing title, artist, and an optional dismiss button.",
  "frontend/src/data/mockShows.ts": "Defines a Show interface and exports mock show data with titles, descriptions, genres, schedules, and images.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on user identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useAlbumArtBackground.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useAppLifecyclePlaybackRecovery.ts": "Handles auto-resuming audio playback on visibility changes, page restore, and focus events, with fallbacks for manual resume.",
  "frontend/src/hooks/useBackgroundImageDiagnostics.ts": "Hook that checks if the body background image loads correctly and logs warnings when missing.",
  "frontend/src/hooks/useChromecast.tsx": "Hook managing Chromecast initialization, session handling, casting state, and errors for a given stream URL.",
  "frontend/src/hooks/useFavoriteStation.ts": "Hook for reading and toggling a boolean favorite flag stored in localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useMarqueeMeasurements.ts": "Hook measuring text overflow and computing marquee animation properties with retries and remount triggers.",
  "frontend/src/hooks/useNotifications.ts": "Hook detecting track or show changes and managing browser notification permissions and display deduplication.",
  "frontend/src/hooks/usePushSubscription.ts": "Hook handling push notification subscription flow, permission requests, SW registration, and backend storage.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching the stream URL with fallback logic, checking stream availability, fetching now-playing data, and submitting user requests.",
  "frontend/src/hooks/useServiceWorkerRegistration.ts": "Implements service worker registration, update handling, reset logic, and state tracking with automatic retries and diagnostics.",
  "frontend/src/hooks/useSleepTimer.ts": "Implements a countdown timer that pauses an audio element after a set duration, with controls to start or cancel the timer.",
  "frontend/src/hooks/useWakeLock.ts": "Manages the screen wake lock API, requesting or releasing it based on activity and handling visibility changes and cleanup.",
  "frontend/src/index.css": "Defines Tailwind layers, theme variables, and responsive background image rules for mobile and desktop.",
  "frontend/src/main.tsx": "Initializes the React app root, sets up React Query and Internet Identity context providers, and loads global styles.",
  "frontend/src/screens/BrowseShowsScreen.tsx": "Renders a filterable list of mock radio shows with genre and day filters and invokes a callback when a show is selected.",
  "frontend/src/screens/HomeLiveScreen.tsx": "Main live listening screen showing station header, live status, and play/pause controls with error and loading states.",
  "frontend/src/screens/NowPlayingScreen.tsx": "Displays full now-playing view with album art, track info, playback controls, volume, share, and sleep timer options.",
  "frontend/src/screens/SettingsAboutScreen.tsx": "Settings page providing notification controls and a background refresh action that clears cached images.",
  "frontend/src/screens/ShowDetailScreen.tsx": "Presents detailed info for a scheduled show with image, metadata, description, and options like adding to calendar.",
  "frontend/src/startup/previewDiagnostics.ts": "Startup diagnostics utility that captures early resource/script errors and optionally shows a recovery overlay.",
  "frontend/src/utils/analytics.ts": "Google Analytics helper utilities for safe tracking of play, pause, and cast events with metadata.",
  "frontend/src/utils/ics.ts": "Generates downloadable ICS calendar files for shows by computing next show dates and formatting event data. Includes helpers for date conversion and parsing show times.",
  "frontend/src/utils/normalizeArtworkUrl.ts": "Normalizes artwork URLs by handling relative, protocol‑relative, and absolute paths while enforcing HTTPS. Returns a cleaned, validated URL or null.",
  "frontend/src/utils/urlParams.ts": "Provides utilities to read URL parameters, persist them in sessionStorage, and manage hash‑based routing values. Includes helpers to clear stored or hash parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, screens, animations, and plugins. Defines project‑specific styling tokens and responsive settings.",
  "project_state.json": "Stores project metadata including features, requests, versioning, and project summary. Tracks marquee scrolling speed adjustments and pending enhancements."
}