{
  "backend/main.mo": "Actor providing user profiles, push subscriptions, radio stream checks, and request storage with access-control enforcement and HTTP outcalls.",
  "feature_evidence.json": "Feature evidence report linking feature requests to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and key behavior of various frontend files.",
  "frontend/DEPLOYMENT_DEBUG.md": "Notes explaining a failed TypeScript build caused by Node.js typings in App.tsx.",
  "frontend/index.html": "HTML entry point configuring meta tags, PWA setup, icons, Google Cast SDK, and a recovery UI for slow React mounting.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, icons, theme colors, categories, and shortcuts.",
  "frontend/public/service-worker.js": "Service worker implementing versioned caching, cache cleanup, push notifications, and offline support for static assets.",
  "frontend/README-verify.md": "Guide for running the frontend verification script to detect build issues.",
  "frontend/scripts/verify-frontend.mjs": "Node-based script that checks for browser-incompatible TypeScript types, runs type checking, and validates asset paths before deployment.",
  "frontend/src/App.tsx": "Main app component managing navigation, playback, lifecycle hooks, and global error handling via an error boundary.",
  "frontend/src/components/CastControl.tsx": "UI control for starting and stopping Chromecast casting, showing status and tracking cast events.",
  "frontend/src/components/InstallPrompt.tsx": "Manages PWA installation prompts and platform-specific guides for iOS and Android with dismissal logic.",
  "frontend/src/components/navigation/BottomTabNav.tsx": "Fixed bottom tab navigation bar allowing switching between home, browse, and settings views.",
  "frontend/src/components/player/MiniPlayer.tsx": "A compact audio player showing track info, artwork, and a play/pause button that opens the full player.",
  "frontend/src/components/player/VolumeSlider.tsx": "Slider component that controls and reflects the volume level of an associated audio element.",
  "frontend/src/components/PushNotificationsPanel.tsx": "Panel for enabling and managing push notification subscriptions with status indicators and error handling.",
  "frontend/src/components/RequestForm.tsx": "Dialog form allowing users to submit song or shoutout requests with validation and backend submission.",
  "frontend/src/components/ServiceWorkerRecoveryBanner.tsx": "Banner prompting users to refresh or reset when service worker errors or app updates are detected.",
  "frontend/src/components/ShareButton.tsx": "A share button component that uses the Web Share API or a fallback modal to copy a URL to the clipboard.",
  "frontend/src/components/shows/ShowCard.tsx": "Renders a clickable card showing show details including image, description, genres, and schedule.",
  "frontend/src/components/status/LiveBadge.tsx": "A red animated badge indicating that content is currently live.",
  "frontend/src/components/status/OnAirIndicator.tsx": "Small animated dot indicating on‑air status.",
  "frontend/src/components/TrackNotification.tsx": "Displays a styled notification for currently playing tracks with different themes and an optional dismiss button.",
  "frontend/src/data/mockShows.ts": "Defines the Show interface and provides mock show data for development.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useAlbumArtBackground.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useAppLifecyclePlaybackRecovery.ts": "Hook that attempts to auto‑resume audio playback when the page becomes visible, focused, or restored from bfcache.",
  "frontend/src/hooks/useChromecast.tsx": "React hook to initialize and manage Chromecast sessions, track availability, casting state, connection status, and handle media loading.",
  "frontend/src/hooks/useFavoriteStation.ts": "Manages a single favorite-station flag using localStorage with a toggle function.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling identity loading, login, logout, and state tracking with Dfinity AuthClient.",
  "frontend/src/hooks/useNotifications.ts": "Monitors now‑playing metadata to detect track, mix, or live changes and triggers browser notifications with deduplication and permission handling.",
  "frontend/src/hooks/usePushSubscription.ts": "Handles web push subscription flow using a service worker and backend actor, including permission requests and storing subscription data.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching stream URL, checking availability, querying now‑playing data, and submitting song requests (stubbed).",
  "frontend/src/hooks/useServiceWorkerRegistration.ts": "Manages service worker registration, update handling, reset functionality, and state tracking with cache-busting and diagnostics support.",
  "frontend/src/hooks/useSleepTimer.ts": "Provides a countdown sleep timer that pauses audio playback after a set duration with start and cancel controls.",
  "frontend/src/hooks/useWakeLock.ts": "Handles acquiring and releasing screen wake locks based on activity state, including auto-reacquisition on visibility change.",
  "frontend/src/index.css": "Defines Tailwind-based global styles and theme variables, including responsive overlay and background rules for dark aesthetic UI.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with query client and Internet Identity provider before rendering.",
  "frontend/src/screens/BrowseShowsScreen.tsx": "Displays a filterable list of shows with genre and day selectors and renders ShowCard components.",
  "frontend/src/screens/HomeLiveScreen.tsx": "Renders the live radio screen with playback controls, now-playing info, quick actions, and error/loading states.",
  "frontend/src/screens/NowPlayingScreen.tsx": "Full-screen now-playing UI showing artwork, track info, playback controls, volume, and sleep timer management.",
  "frontend/src/screens/SettingsAboutScreen.tsx": "Settings page with push notification controls, background refresh handling, and app info sections.",
  "frontend/src/screens/ShowDetailScreen.tsx": "Displays details for a selected show with image, metadata, and actions including adding the event to a calendar.",
  "frontend/src/startup/previewDiagnostics.ts": "Captures early startup errors and shows a recovery overlay when critical resource or script failures occur.",
  "frontend/src/utils/analytics.ts": "Utility for safely sending Google Analytics events with helpers for play, pause, and cast actions.",
  "frontend/src/utils/ics.ts": "Generates and downloads an ICS calendar file for a radio show by computing the next airing date.",
  "frontend/src/utils/normalizeArtworkUrl.ts": "Normalizes artwork URLs, ensuring valid absolute HTTPS paths and handling relative or malformed inputs.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL params (including hash routing), persist them in sessionStorage, and clear them from the hash.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, breakpoints, container settings, animations, and plugin integrations.",
  "project_state.json": "Stores project metadata, feature definitions, and pending requests for background resizing, Home label styling, and Play button visibility changes."
}