{
  "backend/main.mo": "Actor implementing access-controlled user profiles, radio stream availability checks, request logging, and push subscription storage using Maps and OutCall HTTP requests.",
  "feature_evidence.json": "Feature evidence report mapping high-level product features to associated frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Pre-written summaries describing the purpose of various frontend files, including navigation, hooks, styling, and PWA behavior.",
  "frontend/DEPLOYMENT_DEBUG.md": "Debug notes explaining a failing TypeScript build caused by Node.js typings used in browser code, with affected lines listed.",
  "frontend/index.html": "HTML entry point defining PWA metadata, theme color, icons, Google Cast SDK, and a fallback recovery UI if React fails to mount.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, icons, theme colors, categories, and a shortcut for quickly starting the live stream.",
  "frontend/public/service-worker.js": "Service worker handling asset caching, cache version cleanup, and push notifications with detailed logging and icon caching.",
  "frontend/README-verify.md": "Short guide describing how to run the frontend verification script before deployment.",
  "frontend/scripts/verify-frontend.mjs": "Node script that checks for browser-incompatible TypeScript types, runs type checks, and validates asset paths before frontend deployment.",
  "frontend/src/App.tsx": "Main React app component defining navigation, playback logic, lifecycle handling, and an error boundary for UI recovery.",
  "frontend/src/components/CastControl.tsx": "Chromecast control button that starts or stops casting and shows device and connection state.",
  "frontend/src/components/InstallPrompt.tsx": "PWA install prompt logic that detects platform, handles beforeinstallprompt events, and shows platform-specific install guides.",
  "frontend/src/components/navigation/BottomTabNav.tsx": "Bottom navigation bar with Home, Shows, and Settings tabs.",
  "frontend/src/components/player/MiniPlayer.tsx": "Mini audio player showing track info, album art, and a play/pause button.",
  "frontend/src/components/player/VolumeSlider.tsx": "Volume slider that syncs with an audio element and updates its volume.",
  "frontend/src/components/PushNotificationsPanel.tsx": "UI panel for enabling push notifications, showing subscription state, errors, and permission guidance.",
  "frontend/src/components/RequestForm.tsx": "Dialog form for submitting song or shout-out requests with validation and backend submission handling.",
  "frontend/src/components/ServiceWorkerRecoveryBanner.tsx": "Banner that prompts users to refresh or reset when a service worker error or update is detected.",
  "frontend/src/components/ShareButton.tsx": "Share button with Web Share API support and a fallback modal for copying the URL.",
  "frontend/src/components/shows/ShowCard.tsx": "Show card displaying image, metadata, genres, and schedule with click handling.",
  "frontend/src/components/status/LiveBadge.tsx": "Live status badge with animated ping and icon.",
  "frontend/src/components/status/OnAirIndicator.tsx": "Small animated ping indicator for on‑air status.",
  "frontend/src/components/TrackNotification.tsx": "Displays styled now‑playing notifications with icons based on notification type.",
  "frontend/src/data/mockShows.ts": "Mock data defining the Show interface and a list of sample shows.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on Internet Identity and invalidates dependent queries.",
  "frontend/src/hooks/useAlbumArtBackground.ts": "Hook managing album‑art background loading with preloading, fallback handling, and state persistence.",
  "frontend/src/hooks/useAppLifecyclePlaybackRecovery.ts": "Handles audio resume logic on visibility, focus, and bfcache events to restore playback when the app becomes active.",
  "frontend/src/hooks/useChromecast.tsx": "Manages Chromecast API initialization, session handling, device availability, and starting/stopping casting for a stream URL.",
  "frontend/src/hooks/useFavoriteStation.ts": "Stores and toggles a boolean favorite-station flag in localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and helpers for Internet Identity login, state management, and identity persistence using Dfinity AuthClient.",
  "frontend/src/hooks/useNotifications.ts": "Tracks now-playing changes, deduplicates events, manages browser notification permissions, and triggers track/mix/live notifications.",
  "frontend/src/hooks/usePushSubscription.ts": "Handles push subscription creation, permission requests, backend storage, and unsubscribe logic using a service worker.",
  "frontend/src/hooks/useQueries.ts": "Exposes queries and mutations for stream URL retrieval, availability checks, now-playing data polling, and request submissions.",
  "frontend/src/hooks/useServiceWorkerRegistration.ts": "Manages service worker registration, updates, errors, and reset logic including cache clearing and reloads.",
  "frontend/src/hooks/useSleepTimer.ts": "Provides a countdown timer that pauses audio and can be started or canceled.",
  "frontend/src/hooks/useWakeLock.ts": "Requests and releases the screen wake lock based on activity, with visibility handling and cleanup.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom theme variables plus responsive album‑art background and overlay styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/screens/BrowseShowsScreen.tsx": "Displays show listings with genre and day filters and renders ShowCards or a no‑results state.",
  "frontend/src/screens/HomeLiveScreen.tsx": "Renders the live radio screen with artwork, now‑playing info, playback controls, and favorite handling.",
  "frontend/src/screens/NowPlayingScreen.tsx": "Displays the current track with artwork, playback controls, volume, and a sleep timer overlay. Handles play/pause actions, loading states, and background visuals.",
  "frontend/src/screens/SettingsAboutScreen.tsx": "Provides settings for notifications plus information about Mawalking Radio and contact links. Uses cards and buttons to structure content sections.",
  "frontend/src/screens/ShowDetailScreen.tsx": "Shows detailed info for a selected show including image, schedule, genres, and actions like adding to calendar. Pulls mock data and triggers ICS file generation.",
  "frontend/src/startup/previewDiagnostics.ts": "Captures early startup errors and displays a recovery overlay if critical issues occur. Aggregates resource, script, and rejection errors for debugging.",
  "frontend/src/utils/analytics.ts": "Wraps Google Analytics event tracking with safety checks. Provides helpers for play, pause, and cast-related analytics events.",
  "frontend/src/utils/ics.ts": "Generates downloadable ICS calendar files for scheduled shows. Computes next show occurrence and formats dates for calendar standards.",
  "frontend/src/utils/normalizeArtworkUrl.ts": "Validates and normalizes artwork URLs, ensuring HTTPS and handling relative or protocol‑relative paths. Returns a clean absolute URL or null.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading, storing, and clearing URL and sessionStorage parameters, with support for hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending themes, colors, screens, and animations, with plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing app design goals, required images, architecture notes, and existing feature definitions for a mobile-first Mawalking Radio redesign."
}