{
  "backend/main.mo": "Motoko actor defining access-controlled user profiles, radio stream checks, request storage, and push subscription management using http outcalls.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Collection of frontend file summaries describing component behavior, hooks, styles, and PWA functionality.",
  "frontend/DEPLOYMENT_DEBUG.md": "Notes on a failed TypeScript build caused by browser-incompatible Node.js typings in App.tsx.",
  "frontend/index.html": "Main HTML document configuring meta tags, PWA settings, Google Cast SDK, and fallback recovery UI.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, theme colors, icons, categories, and shortcuts.",
  "frontend/public/service-worker.js": "Service worker handling asset caching, cache versioning, cleanup, and push notifications.",
  "frontend/README-verify.md": "Guide explaining how to run the frontend verification script before deployment.",
  "frontend/scripts/verify-frontend.mjs": "Node-based script checking TypeScript config, forbidden NodeJS.Timeout usage, background asset paths, and service worker asset references.",
  "frontend/src/App.tsx": "Main app component managing navigation, audio playback, service worker recovery, and global query configuration.",
  "frontend/src/components/CastControl.tsx": "UI control for starting and stopping Chromecast playback with status indicators and toast feedback.",
  "frontend/src/components/InstallPrompt.tsx": "PWA installation prompt handling platform detection, install guides, and the beforeinstallprompt workflow.",
  "frontend/src/components/navigation/BottomTabNav.tsx": "Renders a bottom tab bar for navigating between home, browse, and settings views.",
  "frontend/src/components/player/MiniPlayer.tsx": "A compact audio player showing track info, album art, and play/pause controls with click-to-open behavior.",
  "frontend/src/components/player/TrackTitleMarquee.tsx": "Creates an animated marquee for long track titles with reduced-motion support and interactive pause behavior.",
  "frontend/src/components/player/VolumeSlider.tsx": "Controls and syncs audio element volume using a slider component.",
  "frontend/src/components/PushNotificationsPanel.tsx": "Panel for enabling and displaying status of push notifications with subscription handling and errors.",
  "frontend/src/components/RequestForm.tsx": "Dialog form for submitting song or shoutout requests using a mutation with validation and toast feedback.",
  "frontend/src/components/ServiceWorkerRecoveryBanner.tsx": "Banner prompting users to refresh or reset the app when updates are available or load errors occur.",
  "frontend/src/components/ShareButton.tsx": "Share button using Web Share API with fallback modal and clipboard copy support.",
  "frontend/src/components/shows/ShowCard.tsx": "Displays show details including image, description, genres, and schedule in a clickable card.",
  "frontend/src/components/status/LiveBadge.tsx": "Shows a red animated LIVE badge with an icon for live status indication.",
  "frontend/src/components/status/OnAirIndicator.tsx": "A small animated accent-colored dot indicating live or active status.",
  "frontend/src/components/TrackNotification.tsx": "Displays a styled notification for tracks with icons and colors based on type, supporting dismiss actions.",
  "frontend/src/data/mockShows.ts": "Defines the Show interface and provides mock data for several radio shows.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refetching queries when identity changes.",
  "frontend/src/hooks/useAlbumArtBackground.ts": "Empty placeholder hook with no implementation.",
  "frontend/src/hooks/useAppLifecyclePlaybackRecovery.ts": "Handles resuming audio playback across visibility changes, focus events, and bfcache restores.",
  "frontend/src/hooks/useBackgroundImageDiagnostics.ts": "Hook that checks body background image after mount and logs a warning if missing.",
  "frontend/src/hooks/useChromecast.tsx": "Hook that initializes and manages Chromecast availability, connections, sessions, and errors for streaming.",
  "frontend/src/hooks/useFavoriteStation.ts": "Hook that stores and toggles a boolean favorite flag in localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity auth client, login state, and stored identities.",
  "frontend/src/hooks/useMarqueeMeasurements.ts": "Hook that measures overflow and computes marquee animation values with retries and dynamic updates.",
  "frontend/src/hooks/useNotifications.ts": "Hook that determines notification type from now-playing data and manages browser notification permission and display logic.",
  "frontend/src/hooks/usePushSubscription.ts": "Hook that manages Web Push subscription flow, permission handling, and backend registration via service worker.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching stream URLs, checking stream availability, retrieving now-playing data, and submitting user requests with fallback and validation logic.",
  "frontend/src/hooks/useServiceWorkerRegistration.ts": "Manages service worker registration, update handling, cache reset, and related state including readiness and update availability.",
  "frontend/src/hooks/useSleepTimer.ts": "Implements a sleep timer that counts down and pauses audio playback when time expires, with controls to start and cancel.",
  "frontend/src/hooks/useWakeLock.ts": "Requests and manages screen wake locks during active playback, handles release events, and re-requests on visibility changes.",
  "frontend/src/index.css": "Defines global Tailwind layers, color variables, and responsive background images for mobile and desktop layouts.",
  "frontend/src/main.tsx": "Bootstraps the React app and wraps it with React Query and Internet Identity providers.",
  "frontend/src/screens/BrowseShowsScreen.tsx": "Displays a filterable list of mock radio shows with genre and day filters and handles show selection.",
  "frontend/src/screens/HomeLiveScreen.tsx": "UI for the home live stream screen with play controls, now‑playing display, and favorite toggle, handling playback states and errors.",
  "frontend/src/screens/NowPlayingScreen.tsx": "Displays detailed now‑playing view with album art, track info, play controls, volume, sharing, and sleep timer support.",
  "frontend/src/screens/SettingsAboutScreen.tsx": "Settings page with notification controls and a background image cache refresh action using service worker and cache APIs.",
  "frontend/src/screens/ShowDetailScreen.tsx": "Show info page displaying show metadata, image, schedule, and options like adding the show to a calendar.",
  "frontend/src/startup/previewDiagnostics.ts": "Startup diagnostics utility that collects early loading errors and shows a recovery overlay if critical issues are detected.",
  "frontend/src/utils/analytics.ts": "Google Analytics helper functions providing safe wrappers for event tracking including play, pause, and cast events.",
  "frontend/src/utils/ics.ts": "Generates an ICS calendar file for a show by computing the next occurrence and creating a downloadable .ics Blob.",
  "frontend/src/utils/normalizeArtworkUrl.ts": "Normalizes raw artwork URLs to valid HTTPS absolute URLs, handling relative, protocol‑relative, and invalid inputs.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and persisting URL parameters, supporting both query strings and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending themes, colors, screens, animations, and enabling plugins like typography and container queries.",
  "project_state.json": "Project metadata defining current features, issues, image requirements, and new feature requests for the build."
}