{
  "kind": "build_request",
  "title": "Fix right-to-left TrackTitleMarquee animation not working",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the TrackTitleMarquee right-to-left scrolling behavior so that when the track title text overflows its container, it reliably animates from right to left in production builds in both the MiniPlayer and the NowPlayingScreen.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "No the right to left audio text animation marque is not working."
        ]
      },
      "acceptanceCriteria": [
        "When the track title text width exceeds its container width, the title visibly scrolls continuously from right-to-left in the MiniPlayer.",
        "When the track title text width exceeds its container width, the title visibly scrolls continuously from right-to-left in the NowPlayingScreen.",
        "When the track title text does not overflow, the title remains static (no animation) and is fully readable without jitter.",
        "The marquee animation respects the user's reduced-motion preference (no scrolling when prefers-reduced-motion: reduce is enabled).",
        "The marquee can be paused/resumed via the existing interactions (pointer down/up and keyboard activation) without breaking subsequent scrolling."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Harden the marquee overflow measurement logic so it re-measures correctly after layout-affecting events (including font loading, text changes, and dynamic container sizing) and cannot get stuck in a non-animated state when the text actually overflows.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "No the right to left audio text animation marque is not working."
        ]
      },
      "acceptanceCriteria": [
        "If the track title changes from short to long (or long to short) while the player is visible, the marquee correctly enables/disables animation within 500ms without requiring a page refresh.",
        "If the container width changes (e.g., device rotation, responsive breakpoint change), the marquee recalculates overflow and scroll distance and continues scrolling smoothly when overflow exists.",
        "If fonts load after initial render and change the measured text width, the marquee re-measures and updates accordingly (no permanent non-animated state when overflow exists).",
        "The measurement/observer logic does not leak observers or event listeners on component unmount/remount (verified by no repeated console warnings and stable performance after repeated navigation)."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or any files under frontend/src/components/ui (compose instead of editing).",
    "Keep all changes within the existing React + TypeScript + Tailwind stack; no new third-party marquee/animation libraries."
  ],
  "nonGoals": [
    "Adding new playback features, audio controls, or changing the now-playing data source.",
    "Changing the overall app navigation or introducing new screens."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}