{
  "kind": "build_request",
  "title": "Ensure live audio stream plays continuously unless user pauses",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-4",
      "text": "Ensure the live audio stream continuously plays and automatically recovers from interruptions unless the user has explicitly paused playback. Add a dedicated \"user intent\" state (e.g., userWantsToPlay) that is set to true only when the user initiates play and set to false when the user pauses (including sleep-timer-triggered pauses), and use it to prevent any auto-resume/auto-reconnect logic from restarting playback after an intentional pause.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Yes and also make sure the stream continuously plays unless paused."
        ]
      },
      "acceptanceCriteria": [
        "If the user taps Play and the stream is interrupted (e.g., network drop, buffering stall, stream ends, audio element errors), the app attempts to recover and resume playback automatically without requiring user interaction.",
        "If the user taps Pause, the app does not auto-resume playback on visibility changes, focus changes, transient audio errors, or other recovery triggers until the user taps Play again.",
        "If the sleep timer expires and pauses the stream, the app treats this as an intentional pause and does not auto-resume until the user taps Play again.",
        "When playback is auto-recovering, the UI reflects an appropriate non-playing transitional state (e.g., \"reconnecting\" / \"buffering\" / \"connecting\") rather than remaining stuck in \"paused\" or \"error\" indefinitely.",
        "The implementation uses the existing app audio element (created in frontend/src/App.tsx) and integrates with the existing lifecycle recovery hook (frontend/src/hooks/useAppLifecyclePlaybackRecovery.ts) rather than creating additional audio elements."
      ]
    }
  ],
  "constraints": [
    "Frontend files under frontend/src/components/ui and the immutable hook/bootstrapping paths listed in SYSTEM_CONTEXT.frontend.immutablePaths must not be edited.",
    "Do not add additional backend services or external databases; all changes must remain within the existing React frontend and single Motoko actor architecture."
  ],
  "nonGoals": [
    "Implement new mobile layout refinements beyond the already-tracked responsive layout features in project state.",
    "Add real-time features (e.g., WebSockets) or third-party integrations to improve streaming reliability."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}