{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix TrackTitleMarquee RTL animation reliability in production",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make TrackTitleMarquee reliably scroll right-to-left on overflow in both MiniPlayer and NowPlayingScreen while preserving pause/resume and reduced-motion behavior.",
      "acceptanceCriteria": [
        "When the track title text width exceeds its container width, the title visibly scrolls continuously from right-to-left in the MiniPlayer.",
        "When the track title text width exceeds its container width, the title visibly scrolls continuously from right-to-left in the NowPlayingScreen.",
        "When the track title text does not overflow, the title remains static (no animation) and is fully readable without jitter.",
        "The marquee animation respects the user's reduced-motion preference (no scrolling when prefers-reduced-motion: reduce is enabled).",
        "The marquee can be paused/resumed via the existing interactions (pointer down/up and keyboard activation) without breaking subsequent scrolling."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useMarqueeMeasurements.ts",
          "operation": "modify",
          "description": "Correct RTL marquee translation math so the animated content starts positioned at the right edge of the container and travels left by the full scroll distance (text width + gap), producing a consistent right-to-left visual scroll in production builds."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Harden marquee CSS to reduce production-only animation failures by ensuring the marquee wrapper uses stable transform/animation behavior (e.g., consistent translate3d usage, max-content sizing, and compositing hints) while keeping prefers-reduced-motion disablement intact."
        },
        {
          "path": "frontend/src/components/player/TrackTitleMarquee.tsx",
          "operation": "modify",
          "description": "Adjust TrackTitleMarquee rendering/structure as needed to support reliable RTL scroll (including keeping pause/resume interactions and reduced-motion behavior) and to ensure the measured element matches the animated layout."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Improve marquee overflow measurement so it re-measures after font loading, text changes, and container resizes without leaking observers or getting stuck disabled.",
      "acceptanceCriteria": [
        "If the track title changes from short to long (or long to short) while the player is visible, the marquee correctly enables/disables animation within 500ms without requiring a page refresh.",
        "If the container width changes (e.g., device rotation, responsive breakpoint change), the marquee recalculates overflow and scroll distance and continues scrolling smoothly when overflow exists.",
        "If fonts load after initial render and change the measured text width, the marquee re-measures and updates accordingly (no permanent non-animated state when overflow exists).",
        "The measurement/observer logic does not leak observers or event listeners on component unmount/remount (verified by no repeated console warnings and stable performance after repeated navigation)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useMarqueeMeasurements.ts",
          "operation": "modify",
          "description": "Refactor measurement/observer logic into a single, shared re-measure scheduler (RAF-throttled) that re-attaches correctly when refs become available, re-measures on ResizeObserver events (container + text), window resize/orientation changes, and font loading completion; ensure all observers/listeners are cleaned up on unmount."
        },
        {
          "path": "frontend/src/components/player/TrackTitleMarquee.tsx",
          "operation": "modify",
          "description": "Update how refs/elements are provided to useMarqueeMeasurements (e.g., using callback refs or stable element state) so observers reliably attach even when the animated/static subtree swaps, preventing the marquee from getting stuck in a non-animated state after dynamic layout changes."
        }
      ]
    }
  ]
}